{"games":[{"yearpublished":1875,"minplayers":3,"maxplayers":6,"playingtime":40,"minplaytime":20,"maxplaytime":40,"age":0,"name":"Game of Bible Questions","description":"This 36-card deck is organized like a Happy Families deck into nine &quot;books&quot; of four cards each. But its play is based on answering questions about the bible, not on simply asking for cards.<br/><br/>Each card indicates which &quot;book&quot; to which it belongs, a topic word (such as Matthew or Calvary), two questions with Bible chapter and verse references, and one answer to another card in the same book.<br/><br/>Each player is dealt six cards. Each in turn asks another player one of the questions on one of his cards. If that person holds the answer card, he hands it over; if not, he becomes the next questioner. If a player holds the answer and either doesn't realize it or refuses to give it up, he must hand over all of his remaining cards!<br/><br/>When a player completes a book, it is set aside and the one with the largest number of books at game end wins.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/o6Ne4ug4dCzMOg4vPiBt6c60DP4=/fit-in/200x150/pic3042296.jpg","image":"https://cf.geekdo-images.com/original/img/vxIPDBt50oDYDqpSs9yREZNndfY=/0x0/pic3042296.jpg","id":"201303","publishers":["Noyes & Snow"],"categories":["Card Game","Educational","Religious"],"mechanics":["Noyes & Snow"]},{"yearpublished":1976,"minplayers":2,"maxplayers":6,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Olympic Yachting","description":"Another simplistic sailing simulation, this one is based on a real event: the sailing competition of the XXI (21st) Olympic Games, Canada 1976. It comes with a huge (58x78cm) board, 6 boats, 3 buoys, 2 dice, a set of sailing cards and a set of advantage cards. Players sail one of the triangle courses as printed on the map; each course is used for a number of boat classes. Start and finish lines are also printed on the board. Wind direction is constant (South), as is the wind force, but some currents are printed on the board that influence the direction sailed. Players roll dice to move, and they need certain die rolls to start the race, change direction or gain sailing or advantage cards. Sailing cards represent difficulties the player must cope with (so they are, in effect, &quot;disadvantage&quot; cards). Special rules apply in the immediate areas around the turn marker buoys. Otherwise, some basic yachting rules, in particular right-of-way rules, must be observed.<br/>The game is completely bi-lingual (English &amp; French, as befits the location) and comes with an &quot;Olympic Information&quot; booklet that explains the sailing events (courses and boat classes) of the XXI Olympic Games as they took place in 1976 in Kingston Bay, Ontario, Canada. This booklet also has a glossary of sailing terms and illustrations of sailing maneuvers.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/zEaFxb9tw4QMtWUVrIVel33SO9c=/fit-in/200x150/pic404115.jpg","image":"https://cf.geekdo-images.com/original/img/N1u57ESvVvTDje-cc31TdFsZcy4=/0x0/pic404115.jpg","id":"39643","publishers":["Pro Games (U.K.) Ltd."],"categories":["Nautical","Racing","Sports"],"mechanics":["Roll / Spin and Move","Simulation"],"designers":["(Uncredited)"],"family":["Sports: Olympics","Sports: Sailing"]},{"yearpublished":1950,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Cowboys and Indians","description":"COWBOYS AND INDIANS board game for young players. Build a Corral, Capture a Pony. The directions are 2,3, or 4 may play, each playing from a Cowboy or Indian &quot;corral&quot; as selected, with colored sticks to match.  Each player spins in turn. The first player spins the arrow. It if points to a pony, the player places a pony in his own corral.  If the arrow points to a color, the player holding sticks of that color,  places one stick in his own corral, no matter who did the spinning.  This continues in turn until one corral has been completely fenced in. Then all the players count their ponies and the one having the most is the winner.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/Okq4Vf1pGbm4TZAOxKXS5sDX_pM=/fit-in/200x150/pic1247166.png","image":"https://cf.geekdo-images.com/original/img/9knEk7ionvlss2Tk1SJwkB1hJA0=/0x0/pic1247166.png","id":"15416","publishers":["Mulder","Saml. Gabriel Sons and Company"],"categories":[null],"mechanics":["Action Point Allowance System","Point to Point Movement"],"designers":["(Uncredited)"]},{"yearpublished":2013,"minplayers":2,"maxplayers":5,"playingtime":100,"minplaytime":100,"maxplaytime":100,"age":12,"name":"Terra Mystica: 4 Town Tiles","description":"A small free expansion, handed out to fans at Spiel 2013.<br/><br/>With this expansion you get four new town tiles.<br/><br/>Tile 1: When taking this Town tile, get 2 Victory points and move 2 spaces forward on each of the 4 Cult tracks. This tile provides 2 Town Keys. <br/>  <br/>Tiles 2 and 3 (double-sided): When taking this Town tile, get 4 Victory points. You may move the Marker on your Shipping track forward one space and get a number of Victory points as indicated on the Shipping space you move to. <br/> Tile 4: When taking this Town tile, get 11 Victory points.<br/><br/>Also available in Terra Mystica: Erweiterungsbogen, a promotional mini-expansion released at Spiel 2015.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/z7foMvW17idyz0mKCCprHsUo1-g=/fit-in/200x150/pic1817884.jpg","image":"https://cf.geekdo-images.com/original/img/2GuI5NzH-pVQjOW4Uk1GAvCJZLA=/0x0/pic1817884.jpg","boardgamecompilation":{"_attributes":{"objectid":"184895"},"_text":"Terra Mystica: Erweiterungsbogen"},"id":"149890","publishers":["Feuerland Spiele"],"categories":["Civilization","Economic","Expansion for Base-game","Fantasy","Territory Building"],"mechanics":["Route/Network Building","Variable Player Powers"],"designers":["Jens Drögemüller","Helge Ostertag"],"artists":["Dennis Lohausen"],"family":["BoardGameGeek Promo Offerings","Terra Mystica"],"expansions":["Terra Mystica"]},{"yearpublished":0,"minplayers":3,"maxplayers":6,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":13,"name":"Zippa Lipps","description":"This is a party game that combines Charades and Chinese whispers, with every player involved in every turn.<br/><br/>It contains a playing board, rule sheet, approximately 4,000 mimes, 6 playing pieces, 5 dice and an egg-timer.<br/><br/>On a player's turn, they role four of the dice to select a mime from the lists provided by putting the four numbers on the dice together.  Each number on the list has a choice of three categories - nouns, verbs and media.<br/><br/>Once a mime is selected, they then select any other player to take out of the room and mime it to them (within a set time limit) using the normal rules of Charades.  No speaking is allowed, so players have to hope their mime is good enough for the other person to get it.<br/><br/>After doing the mime, the first player comes in and selects the next player to go out.  The person who received the mime the first time now has to mime it to the new player...and so on until all players have been outside.  The last player then comes back in and announces what they think is the answer.  Points are then scored and players move around the board until one reaches the finish line.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/wp5qZZDMYkVpmIKTLzDzQjownbo=/fit-in/200x150/pic1963140.jpg","image":"https://cf.geekdo-images.com/original/img/0HgvPFUopuogkC-cJtlRwvzH2iI=/0x0/pic1963140.jpg","id":"152839","publishers":["(Unknown)"],"categories":["(Unknown)"],"mechanics":["Acting","Memory"],"designers":["(Uncredited)"],"artists":["(Uncredited)"],"family":["Charades","Charades In-A-Box"]},{"yearpublished":1985,"minplayers":2,"maxplayers":6,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":8,"name":"Great Western Railway Game","description":"The Great Western Railway (GWR) was one of the earliest railway companies, founded 1835, and built largely by the great British engineer Isambard Kingdom Brunel. It ran from London to the West Country &amp; Wales, and was nicknamed God's Wonderful Railway. This game was produced as a 150th anniversary edition by Gibson Games (and re-issued later) and has a jigsaw board showing the rail network and a deck of 80 cards in coloured sets. Players move their tokens around the main lines and branch lines, collecting, swapping and forfeiting cards to get sets. Movement is determined only by the lines and junctions. The rules say the game was inspired by a railwayman Richard Morris, but the board shows copyright Sara Finch &amp; Leslie Scott.<br/><br/>5,000 copies were made, each with a serial number on the rulebook. A subsequent print run was not numbered and had a few minor changes to the rules.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/GCq8jKP9UHLGKs92tUEwsh5L34M=/fit-in/200x150/pic235158.jpg","image":"https://cf.geekdo-images.com/original/img/OdBhxAkOYXYQaZyuQLMkBSUd9G4=/0x0/pic235158.jpg","id":"2832","publishers":["Gibsons"],"categories":["Gibsons"],"mechanics":["Set Collection","Trading"],"designers":["Sara Finch","Leslie Scott"],"family":["Country: England","Country: Wales"]},{"yearpublished":2014,"minplayers":1,"maxplayers":2,"playingtime":180,"minplaytime":180,"maxplaytime":180,"age":14,"name":"Circle of Fire: The Siege of Cholm, 1942","description":"Though now largely forgotten the successful defense of Cholm by Kampfgruppe Scherer ranks as one of the great small unit sieges of the Second World War and perhaps of all time. Now you can relive the first ten days of this epic battle, when the underfed soldiers of the Soviet 3rd Shock Army attempted to capture the town, its food, and its vital road hub &ldquo;on the march&rdquo; and avoid what would ultimately become a long and unsuccessful siege. As the Soviet side you have more men, stronger artillery, and armor. As the German side you have the town, the high ground, and air power. Hitler has declared Cholm a festung: there will be no withdrawal. In the waist-deep snow and sub-zero temperatures the battle will be fought to the last man and the last grenade.<br/><br/>Circle of Fire by designer Michael Rinella utilizes an updated version of the low-complexity area-impulse system first used in the award-winning Avalon Hill classic Storm over Arnhem. Unlike that game, however, this design includes a hallmark of later area-impulse games: the &ldquo;sudden death&rdquo; mechanism to end turns unpredictably. The game includes a full size area map produced directly from aerial photographs and situational maps, and 176 large counters. Easy to learn, quick to set up, and fast to play, Circle of Fire is both a great introduction to the area-impulse system and a great introductory conflict simulation game.<br/><br/><br/>    Map - One full-color 22&quot;x34&quot; mapsheet<br/>    Counters - 176 full-color 5/8&quot; die-cut pieces<br/>    Rules length - 8 pages<br/>    Charts and tables - 2 pages<br/>    Complexity - Low<br/>    Solitaire suitability - Low<br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/129TJ7fQy5R17MOEGlxJDCOHg5A=/fit-in/200x150/pic1481686.png","image":"https://cf.geekdo-images.com/original/img/r6MWWA6Lm4ZhyqnHRlJ2CRKgXWo=/0x0/pic1481686.png","id":"133940","publishers":["Against the Odds","LPS, Inc."],"categories":["Wargame","World War II"],"mechanics":[null],"designers":["Michael Rinella","Lembit Tohver"],"artists":["Mark Mahaffey"],"family":["Magazine: Against The Odds","\"Storm Over\" area impulse series"]},{"yearpublished":1981,"minplayers":1,"maxplayers":0,"playingtime":180,"minplaytime":180,"maxplaytime":180,"age":12,"name":"Master of the Amulets","description":"Master of the Amulets was MicroQuest #7 in the Metagaming MicroQuests series, programmed adventures for Melee and Wizard.<br/><br/>Expands:<br/><br/>    Wizard<br/>    Melee<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/GmfmJegiAs5Ybd3VtjUtTfGS2CU=/fit-in/200x150/pic70986.jpg","image":"https://cf.geekdo-images.com/original/img/bGST65fKBF4rnRnYdrHkzjBrwNE=/0x0/pic70986.jpg","id":"16651","publishers":["Metagaming"],"categories":["Adventure","Expansion for Base-game","Fantasy","Fighting","Wargame"],"mechanics":["Hex-and-Counter","Role Playing"],"designers":["Mike Monastero"],"artists":["Norman Royal"],"family":["The Fantasy Trip"],"expansions":["Melee","Wizard"]},{"yearpublished":0,"minplayers":2,"maxplayers":2,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Dust Tactics: USMC Assault Squad – \"Hell Blazers\"","description":"Armed with a variety of powerful short range weapons, these Marines are among the most feared in the Pacific. Their Flamethrowers can blow up anything from the heaviest walker to the bulkiest bunker.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/vNuSxneyjS4px2m8yCFPCTOb2dI=/fit-in/200x150/pic3428043.jpg","image":"https://cf.geekdo-images.com/original/img/gc34fKYT8cStHUTwQIZGGcTIHnY=/0x0/pic3428043.jpg","id":"219366","publishers":["Dust Studio"],"categories":["Miniatures","Science Fiction","Wargame","World War II"],"mechanics":["Action Point Allowance System","Dice Rolling","Modular Board"],"designers":["Paolo Parente"],"artists":["Paolo Parente"],"family":["Dust"],"expansions":["Dust 1947","Dust Tactics","Dust Tactics: Revised Core Set"]},{"yearpublished":2004,"minplayers":2,"maxplayers":7,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Blight of the Living Dead","description":"This is a game based off of a map product, Master Plan: Necropolis, also published by UKG. In &quot;Blight of the Living Dead&quot;, up to six players can act as fantasy adventurers seeking out the Lord of the Night (also a player) in the necropolis while battling undead minions and searching chests for treasure that will aid them.<br/><br/>It is a simple game with combat handled by opposed die rolls with variable undead reinforcement also handled by dice.<br/><br/><br/>         NOTE: You MUST have the Master Plan: Necropolis product (or just make your own) to make use of this game! **<br/>    <br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/96M5GcP1JaQDCjD-IGRFARbPImo=/fit-in/200x150/pic259162.jpg","image":"https://cf.geekdo-images.com/original/img/QdwsGqL6m8XsFum2mY23LlkKhts=/0x0/pic259162.jpg","id":"32352","publishers":["UKG Publishing"],"categories":["Fantasy","Horror","Miniatures"],"mechanics":["Action Point Allowance System","Dice Rolling","Variable Player Powers"],"designers":["(Uncredited)"]}]}