{"games":[{"yearpublished":2016,"minplayers":3,"maxplayers":6,"playingtime":15,"minplaytime":15,"maxplaytime":15,"age":7,"name":"Rooster Rush","description":"Rooster Rush &mdash; first released as Gaijin Dash! &mdash; is a party game in which players need to cross multi-lane roadways and avoid oncoming vehicles. Observation, risk-taking, and speed are the three skills you need in order to keep out of the hospital!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/-dZbFby4Zmsf0L0C5TxKY8ZZUNg=/fit-in/200x150/pic3555291.png","image":"https://cf.geekdo-images.com/original/img/NEs77tWNqnPWFgqhkhqP5g80Si4=/0x0/pic3555291.png","id":"195161","publishers":["(Self-Published)","Mayday Games"],"categories":[null],"mechanics":["Betting/Wagering","Player Elimination"],"designers":["Antoine Bauza","Corentin Lebrat"],"artists":["Sergi Marcet","長谷川 登鯉 (Tori Hasegawa)"]},{"yearpublished":0,"minplayers":2,"maxplayers":6,"playingtime":240,"minplaytime":240,"maxplaytime":240,"age":0,"name":"Magiczny Miecz: Labirynt Magów","description":"Sfera released a number of expansions for Magiczny Miecz, three of which were very similar to expansions for Talisman.<br/><br/>Labyrint Magow (Mage's Labyrinth) was similar to the Talisman Dungeon.<br/><br/>It added a board and new cards to encounter. It also added Alternative Endings to the game, much like Talisman's Adventure expansion.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/oUgOWyKcfRWhYgQrtG8F7y2iEyY=/fit-in/200x150/pic193609.jpg","image":"https://cf.geekdo-images.com/original/img/k3Bu-eCcMd0QXf3ZgjpM48LkAFs=/0x0/pic193609.jpg","id":"28575","publishers":["Sfera"],"categories":["Adventure","Fantasy"],"mechanics":["Sfera"],"designers":["Adrian Markowski"],"artists":["Adrian Markowski"],"expansions":["Magiczny Miecz"]},{"yearpublished":2013,"minplayers":3,"maxplayers":8,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":8,"name":"What the Food?! Zombie Edition","description":"A Kickstarter and convention exclusive, the Zombie Edition introduces a 16th character to the cafeteria - Undead Fred.<br/><br/>The Zombie Edition comes with:<br/>1 character ID card<br/>2 starting foods, &quot;Unwashed Tripe&quot; and &quot;Braaaaaiiins&quot;<br/>4 action cards, &quot;Scare&quot;,&quot;Shamble&quot;,&quot;Bite&quot; and &quot;Thrill&quot;<br/>10 wooden bite tokens<br/><br/>Fred can be played like any other food fighter using just his scare card, or he can be played according to the special zombie edition rules where he is on his own team and with a different win condition.<br/><br/>What the Food?! just got more dangerous!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/qs2DPK2Uz0SWIy-1Y2V5fD-gShk=/fit-in/200x150/pic1837767.jpg","image":"https://cf.geekdo-images.com/original/img/ofkCsrTuo9QeJfU0wME6fQtZmWk=/0x0/pic1837767.jpg","id":"150837","publishers":["Squirmy Beast"],"categories":["Card Game","Expansion for Base-game","Fighting","Humor","Zombies"],"mechanics":["Action / Movement Programming","Hand Management","Simultaneous Action Selection","Variable Player Powers"],"designers":["Peter Vaughan"],"artists":["Jean-Sebastien Duclos","Janelle Tibbetts-Vaughan","Peter Vaughan"],"family":["Crowdfunding: Kickstarter","Food / Cooking"],"expansions":["What the Food?!"]},{"yearpublished":2018,"minplayers":1,"maxplayers":8,"playingtime":120,"minplaytime":60,"maxplaytime":120,"age":12,"name":"Elder Sign: Omens of the Pharaoh","description":"An eternal tyrant struggles to return to life from beneath the scorching sands of Egypt in Omens of the Pharaoh, the newest expansion for Elder Sign, a cooperative dice game that takes a team of investigators into the dark corners of H.P. Lovecraft's terrifying mythos. Based on the Dark Pharaoh expansion for the Elder Sign: Omens app, a team of investigators must travel to Cairo and join an expedition to stop the rise of the Dark Pharaoh Nephren-Ka. This dread ruler seeks to return from beyond the grave and continue his blood-soaked reign of terror. What otherworldly forces have preserved Nephren-Ka for all this time, and how can such a being be stopped?<br/><br/>&mdash;description from the publisher<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/JOmgjtkVskR7iBKNZa7dviH-ulA=/fit-in/200x150/pic3835156.jpg","image":"https://cf.geekdo-images.com/original/img/b3elUdrRMR0mvPLuDLUbqEdBq6A=/0x0/pic3835156.jpg","id":"237226","publishers":["Edge Entertainment","Fantasy Flight Games","Heidelberger Spieleverlag"],"categories":["Dice","Expansion for Base-game","Horror"],"mechanics":[null],"designers":["Dane Beltrami"],"artists":["Grzegorz Bobrowski"],"family":["Elder Sign"],"expansions":["Elder Sign"]},{"yearpublished":2007,"minplayers":4,"maxplayers":0,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":18,"name":"What's Cooking?: The Ultimate Party Game for Cooks, Foodies & Friends","description":"From the box: &quot;Whether you're a true food fanatic or just like to cook, this party game will have everyone laughing. Each of the five categories What's cookin'?, What's a spatula?, Melting Pot, Renowned Restaurants, and Foodie First are so diverse that no matter what you're good at, each dinner guest will be a star.&quot;<br/><br/>A variable length party game in which two teams try their hand at the five categories:<br/>What's Cookin'?- guess the dish from the ingredient list<br/>What's a Spatula?- draw the specified kitchen tool and have your teammates guess<br/>Melting Pot- Determine where a dish originated<br/>Renowned Restaurants- Choose the city where a restaurant is located (multiple choice)<br/>Foodie First- write down as many items that you can that within the category given.<br/><br/>Each team gets an equal amount of turns until the food is ready<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/S3T0Vj6JKfmr_Z0hcDdUN-9wfaM=/fit-in/200x150/pic400156.jpg","image":"https://cf.geekdo-images.com/original/img/W5cDqcdH3VOeOqHd3Aw7lElVzW4=/0x0/pic400156.jpg","id":"28929","publishers":["University Games"],"categories":["Party Game","Trivia"],"mechanics":["Cooperative Play","Paper-and-Pencil","Partnerships","Pattern Recognition"],"designers":["(Uncredited)"],"family":["Food / Cooking"]},{"yearpublished":2011,"minplayers":1,"maxplayers":10,"playingtime":11,"minplaytime":11,"maxplaytime":11,"age":8,"name":"Littleroller; Phantom Capsule","description":"A Rules-light Print'n'play tabletop strategy game for 1 or more players, Phantom Capsule revolves around piloting middle-sized robots in defense of a city plagued by monsters.<br/>The game pieces are all constructable papercrafts.<br/>All game-pieces and rules are free and available for download.<br/><br/>Gameplay centers around logistics, in that players decide what to focus their robot's precious energy on before the actual action phase begins.<br/>The monsters operate on rudimentary AI, and largely govern themselves.<br/><br/>The goal of each mission is variable, but typically the player/players must work together to defend a single power plant from invaders. There are also rules for direct competition between players, which gets messy very quickly.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/Q-_S0HHgS-GZWKkq2E6gGP_1KQg=/fit-in/200x150/pic975008.jpg","image":"https://cf.geekdo-images.com/original/img/LFOzxyS3e7LSQVnn_JNVaB--1IA=/0x0/pic975008.jpg","id":"97190","publishers":["(Web published)"],"categories":["City Building","Collectible Components","Dice","Fantasy","Fighting","Horror","Miniatures","Print & Play","Science Fiction"],"mechanics":["Action Point Allowance System","Cooperative Play","Dice Rolling","Variable Phase Order"],"designers":["Matt Pierce"],"artists":["Matt Pierce"]},{"yearpublished":2018,"minplayers":1,"maxplayers":4,"playingtime":40,"minplaytime":20,"maxplaytime":40,"age":10,"name":"End of the Trail","description":"End of the Trail is a competitive card game for 1-4 prospectors and fortune seekers. Players manage a hand of cards to secure transportation, prospect land, and take a shot at winning a title to more land at the poker table. Cards have three uses, each corresponding to a particular phase of the game: to prospect land tiles and discover how much gold a claim will produce, to collect and play cards that build a good poker hand, and to purchase additional cards in auction to help with prospecting, poker, or both.<br/><br/>Prospecting land is a risky business. Players must choose their cards carefully, as they have limited chances to discover the most bountiful sources of gold.  Each time they play a card and peek at a land tile, they must decide if they will stake a claim, placing their prospector&rsquo;s tent, or if they will press their luck and try to find a better claim.  But if a new land tile that they peek at produces less gold than their most previous inspected tile, the player&rsquo;s luck has run out, and they are forced to accept the less bountiful claim.<br/><br/>In the California Gold Rush, fortunes were won and lost at the poker table.  At the end of each round, players must select two of the cards they played for prospecting and add them to the stud poker hand in front of them on the table.  At the end of the game, players reveal their poker hands.  The player with the best poker hand wins another claim, placing their fourth and final prospector&rsquo;s tent on a land tile.<br/><br/>At the end of the game, all hidden values  are revealed and players add up the gold of their various claims.  The player with the most gold wins.<br/><br/>&mdash;description from the publisher<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/MpSE6JXdACSEnfGkpdNiGmfFhZk=/fit-in/200x150/pic4030712.jpg","image":"https://cf.geekdo-images.com/original/img/v_-ALkj2MO6o7uEqJpnBn7YeacU=/0x0/pic4030712.jpg","boardgameaccessory":{"_attributes":{"objectid":"256467"},"_text":"End of the Trail: Deluxe Component Upgrade"},"id":"228378","publishers":["Elf Creek Games"],"categories":["American West","Bluffing","Card Game","Exploration"],"mechanics":["Auction/Bidding","Hand Management","Memory","Modular Board","Press Your Luck","Set Collection"],"designers":["Mike Hinson"],"artists":["Royce Banuelos","Peter Wocken"],"family":["Crowdfunding: Kickstarter","Solitaire Games"],"expansions":["End of the Trail: Outlaw Mini-Expansion"]},{"yearpublished":2010,"minplayers":2,"maxplayers":4,"playingtime":60,"minplaytime":30,"maxplaytime":60,"age":12,"name":"Evolution: The Origin of Species","description":"In Evolution: The Origin of Species, players do the work of nature, putting animals into play and evolving them trait by trait to help them survive and thrive. Each player starts with a hand of six cards that feature an animal on the back and one or two traits on the front.<br/><br/>Each round consists of four phases. During Development, players take turns playing one card from their hand either as an animal (face-down) or as a trait on one of their existing animals (face-up and tucked under the animal). Traits include Carnivorous, Camouflage, Sharp Vision, Swimming, Poisonous and Communication; if a card has two traits, the player chooses which trait the animal acquires, hiding the other trait under the animal. Once a player passes during this phase, he can no longer play cards.<br/><br/>During Food Bank Determination, a player rolls 1-2 dice (possibly adding two to the total) to determine the amount of food available for the round.<br/><br/>During Feeding, players take turns acquiring one food cube and &quot;feeding&quot; one of their animals. Some traits give animals special abilities that can be used during Feeding or at other points during the game. Animals can also be carnivorous, allowing them to attack one other animal to feed &ndash; although that animal might have a defense like High Body Weight or Tail Loss that allows it to survive. An animal can't take more food than it needs unless it has fat tissue, which allows it to store food for future rounds.<br/><br/>During Extinction and Draw, any animal not fully fed dies; the owner takes that animal and all traits and stacks them in his personal discard pile. Each player then receives new cards in hand equal to one plus the number of live animals that player has.<br/><br/>When the deck runs out, the players conduct one final round, then score points. Each live animal is worth 2 VP, and each trait on a live animal worth 1 VP; some traits (Carnivorous and Parasite) provide bonus VPs, but make it tougher to keep an animal alive. The player with the most VPs wins.<br/><br/>By combining two sets of Evolution, you can have up to eight players in a game.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/JlnFkR5Od79g91P6eoMaewafaeg=/fit-in/200x150/pic1048340.jpg","image":"https://cf.geekdo-images.com/original/img/_2ecXB43d2WzsuV29i_lOmKsDxA=/0x0/pic1048340.jpg","id":"71021","publishers":["Rightgames RBG SIA","G3","More Fun Co., Ltd.","RBG","Stolitsa Design Group","TWOPLUS Games","ТРЕТЯ ПЛАНЕТА"],"categories":["Animals","Card Game","Dice"],"mechanics":["Dice Rolling","Hand Management"],"designers":["Dmitry Knorre","Sergey Machin"],"artists":["Dmitry Knorre"],"family":["Theme: Biological Evolution"],"expansions":["Evolution: Continents","Evolution: Plantarum","Evolution: Time to Fly","Evolution: Variation Mini-Expansion","Ewolucja: Pochodzenie gatunków – Rozszerzenie"]},{"yearpublished":2001,"minplayers":2,"maxplayers":10,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":0,"name":"Fowlplay","description":"'Fowlplay, the board game where it's duck season 365 days a year!<br/><br/>Object of the game:  kill your limit of six ducks without going over the limit and return to the clubhouse.<br/><br/>Two to 10 players move shotgun-shaped playing pieces around the board to land in one of four hunting locations:  a blind, a pit, a boat or a log.  Once there, Shell Cards are played to &quot;shoot&quot; and Duck Dice are rolled to see how many birds fly over.  Players draw from the Duck Deck to see what kinds of ducks they kill; some Miss Cards included.  As players move around the board they may land on certain spaces that require drawing a card from the Draw Deck of various consequences.  Fowlplay simulates a real duck hunt featuring real photographs of six species of ducks.<br/><br/>The game is enhanced by the availability of custom playing pieces with your own picture on them!  Fun for ages 6 and up.  Made in USA.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/hDAQjlwyI171RYTpJv0z49dSK7o=/fit-in/200x150/pic164113.jpg","image":"https://cf.geekdo-images.com/original/img/PELrRsc08EahkTlTYeqvuDnR094=/0x0/pic164113.jpg","id":"5500","publishers":["The Fowlplay Co. of Ark."],"categories":["The Fowlplay Co. of Ark."],"mechanics":["Dice Rolling","Line Drawing","Roll / Spin and Move"],"designers":["Stephanie Bradley"],"family":["Sports: Hunting"]},{"yearpublished":1989,"minplayers":2,"maxplayers":4,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":0,"name":"Domino's Pizza Delivery Game","description":"Players are competing Domino's Pizza drivers who draw orders and attempt to deliver them in time.  And naturally, it comes in a box that looks like it could hold a pizza...<br/><br/>From the rules:<br/>&quot;The DELIVERY GAME is genuinely realistic and exciting to play.  Driving situations that occur are everyday encounters taken from real life situations.  Both licensed and unlicensed drivers will enjoy the opportunities for success and the challenges faced by the delivery person.  Game participants will develop safety awareness, rules of the road knowledge and a better &quot;driver&quot; attitude while having fun trying to win!&quot;<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/XEZBjXbq-kuaWLIKX0OhwfN-UMA=/fit-in/200x150/pic61207.jpg","image":"https://cf.geekdo-images.com/original/img/6rKTgTfy9sPtGcTwNhYkX6tGXDk=/0x0/pic61207.jpg","id":"6536","publishers":["Word Quest USA"],"categories":["Economic","Educational","Transportation","Trivia"],"mechanics":["Dice Rolling","Pick-up and Deliver","Roll / Spin and Move"],"designers":["(Uncredited)"],"family":["Food / Cooking","Promotional Board Games"]},{"yearpublished":2006,"minplayers":3,"maxplayers":5,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":8,"name":"Buccaneer","description":"Each player starts with five chips.  To take one of the ship cards, you have to have a stack of chips, the minimum number of chips for each ship being shown on the card.  Making the stacks higher is the game's signature gimmick (originating in Die Safeknacker):  On your turn, you can take one of your chips, or one of your stacks, and put it on top of one chip or stack of another player, and are then the proud owner of the entire stack.  Trouble is, you can't SPEND the stack on a ship until your next turn, by which time somebody else may have taken it away from you by the same process.<br/><br/>Scoring in Die Safeknacker was very streamlined and elegant:  You scored the value of the card when you took it and paid off the other players the values of their chips in your stack.  In this new version there are complications (tokens to collect, a consolation prize for the player next to the top in the stack) which give you a little more to think about.<br/><br/>Re-implements:<br/><br/><br/>     Die Safeknacker<br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/17C8q8wyQFz1Mlda1SntonTbRAk=/fit-in/200x150/pic134519.jpg","image":"https://cf.geekdo-images.com/original/img/ukJ-blF4s9B6diq_gUdK5IutKkc=/0x0/pic134519.jpg","id":"22287","publishers":["Queen Games","G3"],"categories":[null],"mechanics":["Auction/Bidding","Memory"],"designers":["Stefan Dorra"],"artists":["Jo Hartwig"],"family":["Queen Small Box"]},{"yearpublished":2015,"minplayers":2,"maxplayers":10,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":14,"name":"Formula D: Circuits 6 – Austin & Nevada Ride","description":"Formula D: Circuits 6 &ndash; Austin &amp; Nevada Ride is a double-sided game board that adds two new tracks to Formula D. The Circuit of the Americas in Austin, Texas was specially designed to accommodate Formula One cars and has been proudly hosting the United States Grand Prix since 2012. Racers, rev your engines on this highly challenging professional circuit!<br/><br/>A formidable second track based in Las Vegas and through Nevada provides racers with even more thrills! From the famous Bellagio to the Valley of Fire, racers have to survive the death-defying jump over the Colorado River in their attempt to win!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/AhhmsO1WY2nFCNW25ALT6ranmbE=/fit-in/200x150/pic2374206.jpg","image":"https://cf.geekdo-images.com/original/img/mbjndjZU8x66oIiXs7Qs40a7oys=/0x0/pic2374206.jpg","id":"171881","publishers":["Asmodee"],"categories":["Expansion for Base-game","Racing","Sports"],"mechanics":["Dice Rolling","Roll / Spin and Move"],"designers":["Laurent Lavaur","Eric Randall"],"family":["Admin: Better Description Needed!","Formula De/De mini/D","Sports: Auto Racing","States: Nevada"],"expansions":["Formula D"]},{"yearpublished":2005,"minplayers":1,"maxplayers":99,"playingtime":25,"minplaytime":25,"maxplaytime":25,"age":8,"name":"Tangled Tales Adventure Deck- Edgar & Ellen: The Eerie Wax Museum","description":"Edgar &amp; Ellen are troublesome twins who live with their unusual pet, Pet, in a towering, bleak house on the outskirts of the impossibly pleasant town of Nod's Limbs. Pale-faced and clad in tattered footie pajamas, this crafty duo loves to make mischief wherever they go.<br/><br/>Tangled Tales Edgar and Ellen Adventure Deck - The Eerie Wax Mystery<br/>The abandoned Waxworks on the edge of Nod's Limbs holds more than crusty vats and old machinery - strange new plants have taken root in the waxy ruins. When Edgar &amp; Ellen and Pet sneak inside to find a giant snapping plant for Ellen's greenhouse, they stumble upon hideous oozy creatures who've started up the factory again. Mischief is afoot!<br/><br/>You decide what Edgar &amp; Ellen do! Follow the clues to seek out the rare snapping plant... before the wax monsters - or something worse - can get them!<br/><br/>Expands:<br/><br/>    Tangled Tales Starter<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/r_Cdxb8tIUUSBIFFvShvxjU_XLU=/fit-in/200x150/pic442792.jpg","image":"https://cf.geekdo-images.com/original/img/uf3FW-kP_Vgq0B3ZMsKgFtY6BYQ=/0x0/pic442792.jpg","id":"22394","publishers":["Mattel"],"categories":["Book","Expansion for Base-game","Novel-based"],"mechanics":["Cooperative Play","Storytelling"],"designers":["Tadd Callies","Elaine Gant","Eric Hardie","Christopher Lawrence","Brian Yu"],"expansions":["Tangled Tales Starter"]},{"yearpublished":1995,"minplayers":2,"maxplayers":3,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":14,"name":"Lenino","description":"This game simulates tactical battle that took place between October 12 and October 13, 1943, north of the village of Lenino in Byelorussia. Polish and soviet forces were trying to break german defense on the river Miereya. Because of the lack of artillery support and bad commands of the soviet HQ, polish 1st Infantry Division lost above suffered 25% casualties, while soviert forces were too weak to succesfully use polish victory.<br/>The battle is prominent in Polish military history, as it was one of the first major engagements of Polish Armed Forces in the East.<br/>Game was published in the 1st issue of the &quot;Taktyka and Strategia&quot; magazine. It uses rules of the B35 system, meant for all battles fought between 1943-1945. Gathered together, whole rules of this systerm were published in the game &quot;Bitwy II Wojny Światowej&quot;.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/prtxUxI9MxRTya7BCIw8xFyBJFc=/fit-in/200x150/pic1705179.jpg","image":"https://cf.geekdo-images.com/original/img/iGDMVaFyRb9fAkK1XiJFo91ez3U=/0x0/pic1705179.jpg","id":"144543","publishers":["Wydawnictwo MAG"],"categories":["Wargame","World War II"],"mechanics":["Dice Rolling","Hex-and-Counter"],"designers":["Wojciech Zalewski"],"family":["B-35"]},{"yearpublished":2012,"minplayers":3,"maxplayers":5,"playingtime":120,"minplaytime":120,"maxplaytime":120,"age":14,"name":"Aeroplanes: PWS-24","description":"Aeroplanes: PWS-24 is a plane card expansion for Aeroplanes: Aviation Ascendant boardgame.<br/><br/>The PWS-24 was a Polish single-engine passenger aircraft for 4 passengers, built in PWS (Podlaska Wytw&oacute;rnia Samolot&oacute;w) factory, used from 1933 to 1936 by LOT Polish Airlines. It was the only series-built airliner of domestic design ever used by LOT.<br/><br/>Aeroplanes: PWS-24 is a free expansion, created by Phalanx Games Polska to celebrate the release of the Polish edition of the Aeroplanes: Aviation Ascendant boardgame.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/tPpX-73NBMuhadFqgbUpUegXprk=/fit-in/200x150/pic1442077.jpg","image":"https://cf.geekdo-images.com/original/img/RtfEdakZ68WWrLeSrL3V5dIA62g=/0x0/pic1442077.jpg","id":"131867","publishers":["Mayfair Games","Phalanx Games Polska"],"categories":["Aviation / Flight","Economic","Expansion for Base-game","Transportation"],"mechanics":["Area Control / Area Influence","Dice Rolling","Pick-up and Deliver","Route/Network Building"],"designers":["Martin Wallace"],"artists":["Patricia Raubo","Piotr Słaby"],"family":["BoardGameGeek Promo Offerings","Promotional Cards"],"expansions":["Aeroplanes: Aviation Ascendant"]},{"yearpublished":2004,"minplayers":2,"maxplayers":5,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":10,"name":"Zauberzeit","description":"The Players act as wizards while exploring the board which shows the different rooms of a building. They can pick up 48 object-chits. Those chits can represent monsters or objects.<br/><br/>The aim is to find four special objects (hat, staff, orb, book) for the wizard.<br/><br/>Each wizard can also play spell-cards, to help themselves on their quest or annoy the other players.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/XzNHhfZzIJwBUJTxf3ybgaOyXAQ=/fit-in/200x150/pic70364.jpg","image":"https://cf.geekdo-images.com/original/img/fiaQUK9cGtqcd22PBSp7VTSQ6G4=/0x0/pic70364.jpg","id":"13882","publishers":["Prinz Spiele"],"categories":["Exploration","Fantasy"],"mechanics":["Prinz Spiele"],"designers":["Peter Prinz"]},{"yearpublished":2010,"minplayers":3,"maxplayers":6,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":12,"name":"Metropoli","description":"The goal of the game is to build a city of Metropoli and to be the richest player at the end of the game.<br/><br/>There are 4 districts surrounded by 40 tiles. Every district contains 9 blocks and each block is related to two building contracts. None of the blocks are owned by players; they generate income for the owners of the building contracts when a player stops at the department block.<br/><br/>There are 80 building blocks and the game ends when all the blocks are placed on the board. Game also ends when only one player is left (the others have lost everything.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/aIoHN7nYs1Rxuujhe3bkLV845Cc=/fit-in/200x150/pic1228378.jpg","image":"https://cf.geekdo-images.com/original/img/UeUglwgbY9saaIx0gDPdPDmTWhk=/0x0/pic1228378.jpg","id":"66611","publishers":["Editrice Giochi","Tactic"],"categories":["City Building","Dice","Economic","Negotiation"],"mechanics":["Auction/Bidding","Trading"],"designers":["Spartaco Albertarelli"],"artists":["Chiara Vercesi"]},{"yearpublished":2014,"minplayers":2,"maxplayers":2,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":14,"name":"Rivet Wars: The Jetpacker","description":"From the back of the box:<br/><br/>For Professor Winston Nurfle, planes and zeppelins always seemed much too large. Instead, he felt that each man, woman and child should have their own flying propulsion unit. Finally, Nurfle stumbled up the perfect mixture of explosive chemicals to provide thrust for his jet pack. But now, with the wars consuming most research and development Nurfle has donned his prototype and gotten into the fight! He has vowed to prove the combat effectiveness of his invention!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/LDVU49j7VNgv5KPvLTjTXTAXwzs=/fit-in/200x150/pic1542720.jpg","image":"https://cf.geekdo-images.com/original/img/ozZCBaWlfxkhohJ2HXFpyTvAodk=/0x0/pic1542720.jpg","id":"165388","publishers":["CMON Limited"],"categories":["Expansion for Base-game","Miniatures","Wargame"],"mechanics":["Dice Rolling","Grid Movement","Modular Board","Variable Player Powers"],"designers":["Bill Podurgiel","Ted Terranova"],"artists":["Ted Terranova","Peter Wocken"],"expansions":["Rivet Wars: Eastern Front"]},{"yearpublished":2014,"minplayers":1,"maxplayers":1,"playingtime":10,"minplaytime":10,"maxplaytime":10,"age":12,"name":"Chepy","description":"Chepy is a mini version of Pawn's Shephy solitaire card game. It was released at Tokyo Game Market 2014 as a set of 4 postcards, 3 of which are the Chepy playing cards (6 per postcard) which must be cut out prior to playing. The last card is a double sided rules card. All cards are Japanese language only, unlike the dual language (ENG and JPN) Shephy.<br/><br/>The rules are basically the same as Shephy, but scaled down slightly. The player starts with one sheep in their field, and must manage the event cards presented to you in order to accumulate ONE HUNDRED sheep in the field before you go through the deck of event cards three times.<br/><br/>The sheep deck consists of values 1, 3, 10, 30, and 100; at the start of the game, you place a 1 sheep card in your field, then shuffle the event cards and lay out three cards to form your hand. On a turn, you choose one card, carry out its effect, then refill your hand to three cards. Event cards might duplicate existing sheep cards, add new ones, swap one value of sheep for another, remove sheep, etc. Play through the deck until you have no cards in hand, then shuffle the event cards.<br/><br/>If you go through the deck three times without having at least one 100 sheep card in the field or if at any point in the game you have no sheep in the field, then you lose.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/_Eg8eFhvv-_Gbw4AP52Cq_T4vRU=/fit-in/200x150/pic2483892.jpg","image":"https://cf.geekdo-images.com/original/img/PRqdLmxg8EemBI5Vwqsqkuz9ZZU=/0x0/pic2483892.jpg","id":"169761","publishers":["Bouken"],"categories":["Bouken"],"mechanics":["Hand Management","Set Collection"],"designers":["Pawn"],"artists":["Pawn"],"family":["Animals: Sheep"]},{"yearpublished":1992,"minplayers":2,"maxplayers":2,"playingtime":10,"minplaytime":10,"maxplaytime":10,"age":0,"name":"Cloister Games","description":"Cloister Games is a nicely presented compilation of four medieval games, typical of those found etched onto monastery floors.  Fox and Geese is played on a board instantly recognizable to us as solitaire. The single Fox wins by jumping over the geese, landing on an empty point and thereby diminishing the flock until it is no longer viable. The geese win by hemming in the fox  so he cannot move. It's not easy to win as the geese. The fascinating game of Merels is better known as Nine Mans Morris and has an entry to itself elsewhere in this database. Albuquerque is perhaps the pick of the bunch, with a strategy resembling a cross between draughts and Merels and its influence is clearly to be seen in modern derivatives such as Kensington. Finally, Fierges is identical to draughts but without the compulsion (huffing) rule.  Each  game is eminently playable in its own right and, together, provide a fascinating insight into the development of modern draughts (checkers). The four boards are beautifully illuminated in medieval style and accompanied by wooden pieces.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/irxzSxJhxR2CYg0ZpQYxEpzmSCY=/fit-in/200x150/pic23638.jpg","image":"https://cf.geekdo-images.com/original/img/Dwn7lCsdp7s5G89C7sAZRv6LohA=/0x0/pic23638.jpg","id":"6136","publishers":["Historical Collections Group plc","Oxford Games, Ltd."],"categories":[null],"mechanics":["Area Enclosure","Area Movement","Point to Point Movement"],"designers":["Sara Finch","Leslie Scott"]},{"yearpublished":2016,"minplayers":3,"maxplayers":5,"playingtime":20,"minplaytime":10,"maxplaytime":20,"age":10,"name":"Dungeoning","description":"User summary:<br/>ダンジョニング (Dungeoning in Japanese) is a RPG Adventure-like card game by the Japanese doujin circle T-Club released for the 'Game Market 2016 Autumn' convention in Nagoya, Japan in 2016.<br/><br/>Dungeoning is a video-game RPG-themed co-operative exploration game. One player plays the Dark Lord and the remaining players each one hero.<br/><br/>The Dark Lord powers have been sealed off and he's weak. However, he is recovering slowly in his Dungeon.<br/><br/>Aware of the coming crisis, the brave heroes enter the Dungeon and start their quest to defeat the Dark Lord in his Dungeon before he can recover his powers.<br/>If they manage to do so they win. Otherwise the Dark Lord kills them and reign over the world.<br/><br/>The Heroes' goal is to reach the Dark Lord to defeat him for good. From the entrance, they need to reach the Dark Lord's throne: if any Hero player can move to the same room as him, the Heroes wins.<br/>The Dark Lord's goal is to recover enough power or kill off all the Hero players.<br/><br/>The Game plays roughly as the following.<br/><br/>0) Setup<br/>First one player gets choosen to be the Dark Lord for the game. He picks up the black character.<br/>Shuffle all the Hazard cards together, return 3 cards to the box and deal 3 to the Dark Lord.<br/>Then, each hero player chooses a colored character and gets assigned randomly a Job card.<br/>Last but not least, the Dungeon tile cards are shuffled layed out as a grid, face down, except for the Dark Lord's throne, in the top left corner, and the dungeon's entrace, in the bottom right corner. Place the Dark Lord character on his throne and the Hero characters all at the entrance.<br/><br/>1) Heroes' Turn<br/>Each heroes choose secretly one of the following action: Move, Heal or Ability.<br/>When all decided, all the Heroes reveal their action at once and proceed to resolution. The play order doesn't matter here.<br/>Each dungeon tile  card represents two rooms. Heroes can only enter a room if there is no wall blocking access. Players will reveal dungeon tile cards as needed when exploring new areas of the dungeon. Be careful of traps!<br/><br/>2) Dark Lord's Turn<br/>During he can play choose on of the following action: accumulate power, play an Hazard card to attack/delay the Heroes, or renew his hand.<br/><br/>Repeat 1) and 2) until either:<br/>- any hero reaches the same room as the Dark Love -&gt; the Heroes win<br/>- the Dark Lord has killed all the Heroes or has exhausted the Hazard cards deck.<br/><br/>Description from the publisher:<br/>『ダンジョニング』は協力型ダンジョン探索ゲームです。<br/>プレイヤーは勇者（２～４人）と魔王（１人）に分かれて戦います。<br/>魔王は完全復活するまで、勇者が近づけないよう邪魔をしてください。<br/>勇者は完全復活する前に魔王に近づき封印してください。<br/>勇者達の意思疎通が勝利の鍵です！<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/DVetPphGWxvh9Ci-2vvmRx6uiYA=/fit-in/200x150/pic3583978.jpg","image":"https://cf.geekdo-images.com/original/img/lH-qmh3ZFSndQzUodVW1T-MjdWw=/0x0/pic3583978.jpg","id":"228398","publishers":["てぃ-くらぶ (T-club)"],"categories":["Card Game","Exploration","Video Game Theme"],"mechanics":["Cooperative Play","Grid Movement","Hand Management","Role Playing"],"designers":["welch","はる (Haru)"],"artists":["welch","ごんたろう (Gontarou)"]},{"yearpublished":1979,"minplayers":2,"maxplayers":2,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":7,"name":"TUGG 2","description":"A &quot;Tri-Level Game for Ages 7 to Adult&quot; described on the side of the box as a &quot;Fast Game of Fun and Strategy for Two&quot;.  The board has some similarities to that of games in the Morris family, though piece placement is guided by die roll.  The game's objective is to form sets of three pieces in a row, either via direct placement or via moving the pieces along lines on the board, with victory coming when a player reaches 16 points.<br/><br/>","id":"109273","publishers":["Martin Douglas Sales Enterprises"],"mechanics":["Martin Douglas Sales Enterprises"]},{"yearpublished":2006,"minplayers":3,"maxplayers":6,"playingtime":120,"minplaytime":120,"maxplaytime":120,"age":12,"name":"Age of Steam Expansion: Eastern US & Canada","description":"This Age of Steam expansion extends the base game Rust Belt map to include the Eastern USA and Canada, from Savannah, Georgia to Quebec, Canada. Both maps are used together to play this 3-6 player game. The game introduces the Marketing action and new rules concerning track building, interurban links, goods growth and production.<br/>This expansion was released as a limited, numbered Essen Set by Winsome Games at Essen 2006. A thematic Turn Order marker was also included with the numbered Essen Set.<br/><br/>Expands:<br/><br/>    Age of Steam<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/onWHVU6XHYCL4RKqtMX_5JFH13k=/fit-in/200x150/pic144356.jpg","image":"https://cf.geekdo-images.com/original/img/Z6LP706OPwoDzSCYjzERkgwTn94=/0x0/pic144356.jpg","id":"25300","publishers":["Winsome Games"],"categories":["Expansion for Base-game","Trains","Transportation"],"mechanics":["Pick-up and Deliver","Tile Placement"],"designers":["John Bohrer"],"family":["Age of Steam","Country: Canada"],"expansions":["Age of Steam"]},{"yearpublished":0,"minplayers":2,"maxplayers":6,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":5,"name":"Pacific Coast Trail","description":"The mode of travel in the game, hiking, introduces players to the situations and problems that are usually encountered while traveling from one location to another. The game also familiarizes the players with the opportunities to visit different national ecological gifts, canyons, parks and mountains along their travel route.<br/><br/>Contents:<br/><br/>     1 - six sided die<br/>     12 - player pieces<br/>     4 sets of red regional cards (20 cards each)<br/>     4 sets of green regional cards (20 cards each)<br/>     100 - thin sheet Inventory Cards (can be copied to fill future use)<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/yPUrlMzrhjrkH8AUu5q_umropJs=/fit-in/200x150/pic635546.jpg","image":"https://cf.geekdo-images.com/original/img/e5A4H-bZsG7vexwqx38kPu-XDVc=/0x0/pic635546.jpg","id":"62085","publishers":["(Unpublished)"],"categories":["Educational","Travel","Trivia"],"mechanics":["Roll / Spin and Move","Set Collection"],"designers":["Robert Reaves"]},{"yearpublished":1999,"minplayers":2,"maxplayers":2,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Escape from the Witch!","description":"From the Rulebook:<br/><br/>&quot;Both players roll the die.  The player with the highest number goes first, and chooses whether to be Hansel and Gretel OR the Wicked Witch.  Both players place their markers on their own Start squares.<br/>- On your turn, roll the die and move your marker that number of squares.<br/>- You can move in any direction.<br/>- If you land on a sweet, play again.<br/><br/>IF YOU ARE HANSEL AND GRETEL:<br/>- You must go through the cookie house then back home before the Wicked Witch catches you.<br/>- You can follow the trail of white pebbles or the trail of breadcrumbs to escape from the witch.<br/>- You need the exact number to get home.  If the number you roll is too high, move backwards the remaining number of squares.<br/><br/>IF YOU ARE THE WICKED WITCH:<br/>- You must catch Hansel or Gretel by landing on the same square with the exact number.<br/>- You cannot follow the trail of white pebbles or the trail of breadcrumbs.<br/><br/>The game is over either when Hansel and Gretel get back home, OR when the Wicked Witch catches them!&quot;<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/Lv-wtDnkuXXjpvfS0AvrbhTel20=/fit-in/200x150/pic715649.jpg","image":"https://cf.geekdo-images.com/original/img/Pns60P1p89-NSsZrwiujdERtiyE=/0x0/pic715649.jpg","id":"70392","publishers":["Tormont"],"categories":["Children's Game","Fantasy","Novel-based"],"mechanics":["Tormont"],"designers":["(Uncredited)"],"family":["Witches"]},{"yearpublished":0,"minplayers":2,"maxplayers":2,"playingtime":45,"minplaytime":30,"maxplaytime":45,"age":8,"name":"Conquest","description":"&Kappa;&alpha;&tau;ά&kappa;&tau;&eta;&sigma;&eta; (Conquest) is a wargame very much alike to Stratego.<br/><br/>The gameboard is a 3D battlefield. You have an army of men at your disposal and your mission is to win your opponent's army.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/cVGGityXj_0rGGV6RXzI_nnUbso=/fit-in/200x150/pic2427678.jpg","image":"https://cf.geekdo-images.com/original/img/hnuCvxtUmlF4xBHvx_QHHlSJSUU=/0x0/pic2427678.jpg","id":"174036","publishers":["MIKA"],"categories":["Abstract Strategy","Bluffing","Deduction","Fighting","Memory","Wargame"],"mechanics":["Grid Movement","Memory","Secret Unit Deployment"]},{"yearpublished":0,"minplayers":3,"maxplayers":0,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Bluff","description":"Card game with a lot of bluffing involved.<br/><br/>Rules (as written on the back of the box)<br/><br/>The object of the game is, by bluffing, to be the first player to dispose of all his cards.<br/>The cards are shuffled and dealt to all the players. The player to the left of the dealer begins by placing one card face down onto the centre of the table and names its picture, for example saying &quot;flower&quot;. The next player puts a card on top of it also saying &quot;flower&quot;, this is when the bluffing comes in. Each player in his turn has to claim to lay the same picture as that which was started with whether he has one or not. Play continues in this way until the call comes back to the player who started the round. He calls again the name of the picture he started with and lays a card. This is the end of that round. The next player starts a new round by placing a card on top of the cards already on the table (if any) and names the same or a different picture.<br/>Any time a player thinks another player is bluffing he may challenge him. If he is in fact bluffing and has not laid the card he said, he has to pick up all the cards on the table and add them to his hand. If he was not bluffing the challenger has to pick up all the cards.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/zyGXMUEbzDoepgxnh45UW0bHy9o=/fit-in/200x150/pic1218114.jpg","image":"https://cf.geekdo-images.com/original/img/4EFIVOZM7_5NlXjeR7-k5TtQt_4=/0x0/pic1218114.jpg","id":"119088","publishers":["Spear's Games"],"categories":["Bluffing","Card Game","Children's Game"],"mechanics":["Spear's Games"]},{"yearpublished":2001,"minplayers":1,"maxplayers":2,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":0,"name":"Admiral On Deck","description":"Admiral On Deck is the first of several planned free expansions for Queen Victoria's Navy. It is being freely distributed, so ownership of Queen Victoria's Navy is not needed to download and view the file.<br/><br/>Admiral On Deck introduces several advanced rules to Queen Victoria's Navy. Rules for crew and admiral quality, shore batteries, mines, and smaller ship classes such as torpedo boats are included. Admiral On Deck will allow players to play historical scenarios from the 1894-95 Sino-Japanese war and the 1904-1905 Russo-Japanese war.<br/><br/>Included are 6 pages of advanced rules and 1 additional set of game charts. Scenarios are included for the opening engagement between the Chinese and Japanese cruisers that started the Sino-Japanese war of 1895, the Battle of the Yalu (1894-Sep-17, Sino-Japanese war), the Battle of the Yellow Sea (1904-Aug-10, Russo-Japanese war), and the Battle of Tushima (27..28-May-1905, Russo-Japanese war). The appropriate ship and utility counters are also included, in both full color and non-colored versions (but players will have to mount the counters themselves).<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/jZrMLzCwC9a7i9d-_FL05-EBj3k=/fit-in/200x150/pic423360.jpg","image":"https://cf.geekdo-images.com/original/img/p9fhDG9MF_C5hQhA3Q9Ujasj3Lw=/0x0/pic423360.jpg","id":"3345","publishers":["BoneGames"],"categories":["Expansion for Base-game","Nautical","Print & Play","Wargame"],"mechanics":["Action Point Allowance System","Hex-and-Counter"],"designers":["Bruce Biskup","Joshua Howard"],"family":["Queen Victoria's Navy"],"expansions":["The Bombardment of Alexandria 1882","Queen Victoria's Navy Ship List Pack #1: China/Russia/Japan","Queen Victoria's Navy"]},{"yearpublished":2003,"minplayers":2,"maxplayers":6,"playingtime":360,"minplaytime":360,"maxplaytime":360,"age":12,"name":"Brute Force: The War in the West, 1940-1945","description":"The second installment in the Clash of Arms Games's Struggle for Europe series - the first was War Without Mercy.<br/><br/>Brute Force highlights three pivotal campaigns from the West Front: <br/><br/>    Norway, <br/>    The 1940 Blitzkrieg in the West<br/>    Operation Overlord. <br/><br/><br/><br/><br/>In each, both commanders are faced with numerous operational decisions. Proper allocation of the limited air and naval support is just as important as deciding manpower assignments. Both sides have opportunities to make numerous decisions affecting the outcome of the campaign. For the Allied commander, deciding where and when to commit the small but powerful BEF in 1940 is a choice as difficult as that facing the Axis commander concerning his limited panzer forces in 1944.<br/><br/>Units are Corps, Divisions, and Brigades. One hex equals 30 miles. One turn is about 2 weeks.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/_hRtpjgKNKQWeGe9e3J7NljtrBg=/fit-in/200x150/pic21856.jpg","image":"https://cf.geekdo-images.com/original/img/gwGj-juB5ihbXtl_DHfipS6TqHA=/0x0/pic21856.jpg","id":"5822","publishers":["Clash of Arms Games"],"categories":["Wargame","World War II"],"mechanics":["Clash of Arms Games"],"designers":["Rob Beyma"],"family":["Struggle for Europe"]},{"yearpublished":2007,"minplayers":2,"maxplayers":10,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":7,"name":"UNO: Arsenal Highbury Legends","description":"Themed Uno game based on the football (soccer) club, Arsenal Highbury.<br/><br/>WHAT MAKES IT DIFFERENT FROM TRADITIONAL UNO: The special &quot;Red Card&quot; and &quot;Yellow Card&quot; cards and rules (referring to the card penalties given by players for infractions), which do not correlate to cards/rules in regular Uno.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/KvBJf8Wm9ocEFOzmGZBac88fnR4=/fit-in/200x150/pic561509.jpg","image":"https://cf.geekdo-images.com/original/img/yBVLFrxw1wVmYRb_9Dbw618hej0=/0x0/pic561509.jpg","id":"34994","publishers":["Sababa Toys, Inc."],"categories":["Card Game","Sports"],"mechanics":["Sababa Toys, Inc."],"designers":["(Uncredited)"],"family":["Arsenal Football Club","Sports: Football / Soccer","UNO"]},{"yearpublished":2008,"minplayers":2,"maxplayers":10,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":0,"name":"Formula Dé: ITALY SERIES – Roma Isola Tiberina","description":"This is a Formula D&eacute; course available for download online - created by Alessandro Crespi. It is a course based on Italian capital city (Rome). <br/>It prints out on 10 A4 pages.<br/>During this race you will cross &quot;Tevere River&quot; around &quot;Tiberine Island&quot;.<br/>This is part of a track series called &quot;ITALY SERIES&quot;, available online for free.<br/><br/>01. Formula Dé: ITALY SERIES – Bologna Centro<br/>02. Formula Dé: ITALY SERIES – Roma Colosseo<br/>03. Formula Dé: ITALY SERIES – Roma Isola Tiberina<br/>04. Formula Dé: ITALY SERIES – Milano Castello Sforzesco<br/>05. Formula Dé: ITALY SERIES – Bologna Stadio Dall'Ara<br/>06. Formula Dé: ITALY SERIES – Palermo Marina<br/>07. Formula Dé: ITALY SERIES – Trieste Porto<br/>08. Formula Dé: ITALY SERIES – Agrigento Valle dei Templi<br/>09. Formula Dé: ITALY SERIES – Torino Centro<br/>10. Formula Dé: ITALY SERIES – Firenze Lungo Arno<br/>11. Formula Dé: ITALY SERIES – Commemorative Track<br/>12. Formula Dé: ITALY SERIES – Misano, Santa Monica<br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/vMGsZaiB6CYIKaAExMyC3hhnR_g=/fit-in/200x150/pic401530.jpg","image":"https://cf.geekdo-images.com/original/img/8g4cO1SelaTypAE6kAwie2a2IV4=/0x0/pic401530.jpg","id":"39418","publishers":["(Web published)"],"categories":["Expansion for Base-game","Racing"],"mechanics":["(Web published)"],"designers":["Alessandro Crespi"],"family":["Cities: Rome","Country: Italy","Formula De/De mini/D","Sports: Auto Racing"],"expansions":["Formula Dé"]},{"yearpublished":2012,"minplayers":2,"maxplayers":2,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Traitor Race","description":"This is Game #31 in the Games on Half a Checkerboard Series.<br/><br/>It is a 2 player traitor game.  In the game, players don't know if they are on the same side, or opposing sides.  They try to figure this out and either help the human side win the race, or undermine it so the neutral player wins by either losing the race or failing in too many attempts during the race to exceed the current number.<br/><br/>During turn, players will play cards from their hand, trying to exceed the prior turn's target number, in a mechanic like 2-5 Skidoo.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/u2b-aQoj1xCkjkJ2gz4oZVVU6-4=/fit-in/200x150/pic1543862.jpg","image":"https://cf.geekdo-images.com/original/img/i-70r3nUENHE-3OjsEIYKM4eEGQ=/0x0/pic1543862.jpg","id":"128928","publishers":["(Web published)"],"categories":["(Web published)"],"mechanics":["(Web published)"],"designers":["Richard Hutnik"]},{"yearpublished":0,"minplayers":2,"maxplayers":0,"playingtime":6,"minplaytime":6,"maxplaytime":6,"age":6,"name":"Thüringer Land wie bist du schön","description":"Objective: be the first ending a round trip in Erfurt (Thuringia)<br/> - moving by turns -<br/>simple 'Roll &amp; Move' game; ending on a marked space follow instructions...<br/>remarks:<br/>published ~1950's in the GDR<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/sqHQULfL23AGED4xbskdzU9bgP0=/fit-in/200x150/pic1608815.png","image":"https://cf.geekdo-images.com/original/img/r6VNfKzJjEchoeRvalYMZtDECA4=/0x0/pic1608815.png","id":"140221","publishers":["VEB Druck und Verpackung Dresden"],"categories":["Children's Game","Dice","Educational","Racing","Travel"],"mechanics":["VEB Druck und Verpackung Dresden"],"designers":["Kurt Eggert"]},{"yearpublished":1981,"minplayers":2,"maxplayers":2,"playingtime":5,"minplaytime":5,"maxplaytime":5,"age":0,"name":"Order and Chaos","description":"Order and Chaos is played on a 6x6 square grid. On a turn a player writes either an X or an O in any empty space. The object of the first player (Order) is to complete a line of five Xs or five Os in any direction. The object of the other player (Chaos) is to prevent this.<br/><br/>The game was published in the September/October 1981 issue of GAMES.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/vQdRRtpNt9Rj1zs1Q1Ny3U43PQI=/fit-in/200x150/pic4084483.jpg","image":"https://cf.geekdo-images.com/original/img/Cg0qSik0tk6da7BfoFM6ZMbjyFc=/0x0/pic4084483.jpg","boardgamecompilation":{"_attributes":{"objectid":"126108"},"_text":"Flying Colors"},"id":"147859","publishers":["GAMES Magazine","Kadon Enterprises"],"categories":[null],"mechanics":[null],"designers":["Stephen Sniderman"],"family":["Combinatorial"]},{"yearpublished":2013,"minplayers":1,"maxplayers":6,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":13,"name":"Zombicide: Box of Zombies Set #3 – Angry Zombies","description":"This box includes 24 berserker zombies and 6 additional spawn cards to include them into any Zombicide base game.<br/><br/>Sculpts of the zombies are from the Zombicde Season Two: Prison Outbreak, although three exclusive sculpts are included.<br/><br/>Zombie sculpt breakdown<br/>15 Berserker Walkers (5 of a mix of 2 Box of Zombies only sculpts)<br/>6 Berserker Runners<br/>3 Berserker Fatties (2 of the Box of Zombies only sculpt)<br/><br/>Spawn cards (139-144) come with a higher density of Berserker zombies than Prison Outbreak's deck.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/34AX1kX4Axl5lcVEb__xuPrH3NQ=/fit-in/200x150/pic1857320.jpg","image":"https://cf.geekdo-images.com/original/img/U-n7yIeydmeeSiyZPgtSfi82758=/0x0/pic1857320.jpg","id":"139866","publishers":["CMON Limited","Guillotine Games"],"categories":["Expansion for Base-game","Horror","Miniatures","Zombies"],"mechanics":["Action Point Allowance System","Cooperative Play","Dice Rolling","Hand Management","Modular Board","Variable Player Powers"],"designers":["Raphaël Guiton","Jean-Baptiste Lullien","Nicolas Raoult"],"family":["Zombicide"],"expansions":["Zombicide","Zombicide Season 2: Prison Outbreak"]},{"yearpublished":2014,"minplayers":1,"maxplayers":4,"playingtime":5,"minplaytime":5,"maxplaytime":5,"age":10,"name":"TwentyOne","description":"It's like Blackjack, with dice! Secretly roll for your hand, then press your luck to get closer to 21 and use your bluffing skills to score victory points each round.<br/><br/><br/>     Full Set has enough components for 2 players. For Four-Player games get the Full Set + Extras.<br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/liInN5gi43jfInJLlS1BJLMpnyI=/fit-in/200x150/pic2232955.jpg","image":"https://cf.geekdo-images.com/original/img/G3EzE7Ew5BR5-HWFr9TfCOdf-cg=/0x0/pic2232955.jpg","boardgamecompilation":{"_attributes":{"objectid":"164250"},"_text":"5Pax"},"id":"164944","publishers":["Galliant Games"],"categories":["Abstract Strategy","Bluffing","Dice"],"mechanics":["Betting/Wagering","Dice Rolling","Press Your Luck"],"family":["Admin: Better Description Needed!","Admin: Unreleased Games","Crowdfunding: Kickstarter"]},{"yearpublished":1989,"minplayers":2,"maxplayers":4,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":9,"name":"Flugreisespiel","description":"Objective: be the 1st to bring 3 of your 4 planes down to the airport<br/>merely a 'Roll and move' game with one exception:<br/>the action 'Positionswechsel' which means 'change of position'<br/>the more players the better because if the board is 'crowded' this action can be worked out easily<br/>==&gt; even if your plane(s) trail behind there's a chance to win<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/gJYnQ6SYHxOmZJFtgQlRJfso-U8=/fit-in/200x150/pic1137805.png","image":"https://cf.geekdo-images.com/original/img/AUnDbWvuEUJ5IWmpjGEVFObJs0w=/0x0/pic1137805.png","id":"111811","publishers":["Espenlaub","Georg Appl"],"categories":["Aviation / Flight","Dice"],"mechanics":[null],"designers":["Herbert Knabe"],"artists":["Friedemann Hett"]},{"yearpublished":1993,"minplayers":2,"maxplayers":4,"playingtime":20,"minplaytime":20,"maxplaytime":20,"age":6,"name":"Räuber und Gendarm","description":"Content:<br/>4 robbers (wooden),<br/>1 policeman,<br/>die,<br/>board<br/><br/>4 robbers heavily loaded with valuable treasures try to creep home through the forest. But the path to the robbers' cave is not easy to travel, because the gendarme are already following them. Will the robbers be able to bring their treasures home safely? Everyone tries to bring its robber with the accumulated valuable treasure to the hiding place first.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/ExoOT9Oyc2PzgSIEFVqDoZe5UdI=/fit-in/200x150/pic300560.jpg","image":"https://cf.geekdo-images.com/original/img/bbzrDqGkQ4KrIgwij2szX5HOCcA=/0x0/pic300560.jpg","id":"34677","publishers":["Ravensburger Spieleverlag GmbH"],"categories":["Children's Game","Dice"],"mechanics":["Area Movement","Dice Rolling"],"designers":["Manfred Ludwig"]},{"yearpublished":1967,"minplayers":2,"maxplayers":4,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":0,"name":"Sum Times","description":"A 3M edition of the &quot; Edu - PLAY - tional &quot; series.<br/><br/>Game is similar - if not better! -  equipped as &quot; Quinto &quot; from the adult bookshelf series of the same company and plays nearly the same.<br/><br/>You can tell that this is the better &quot;Quinto&quot; as it was edited earlier than the Quinto using the number tiles which have to be drawn in the pre-game-phase and was obviously adapted later.<br/><br/>Accordingly this is not a game for younger children as you have to be fit in multiplying and addition up to the number of 9.<br/><br/>There were two editions with completely different box design, the second one from 1968.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/E8tKSaLTJ2I3GhbNlv8_nm6CJZo=/fit-in/200x150/pic279862.jpg","image":"https://cf.geekdo-images.com/original/img/GGcLSOLXNgawUC9EKDLz35dGDl0=/0x0/pic279862.jpg","id":"33057","publishers":["3M","Spear's Games"],"categories":["Educational","Number"],"mechanics":[null],"designers":["Richard Dixon"],"family":["3M Learning Series"]},{"yearpublished":2006,"minplayers":4,"maxplayers":0,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":10,"name":"Blibber Blabber","description":"Bibber Blabber: &quot;Where Blinglish is a Second Language&quot;<br/><br/>Blibber Blabber is another family word game from Patch Products.<br/><br/>Players take turns replacing the first sounds of all the words you want to say with a specific letter sound and see if your team can guess the Blibber you are blabbing. It's a tongue-twisting game of funny sounds and phrases.<br/><br/>On each turn, spin to find out which letter sound will be used to describe the words on the Blibber chip you have drawn. For example, if your Blibber is &quot;Penguin,&quot; and you spin &quot;B,&quot; you must begin all your words with the &quot;B&quot; sound. You might want to say, &quot;This animal lives in the Arctic,&quot; but instead would have to say, &quot;Bis Banimal Bivs Bin Be Barctic.&quot; If you spin the letter combination &quot;SH,&quot; it would be, &quot;Shis Shanimal Shivs Shin She Sharctic.&quot;<br/><br/>You can pass if your team gets stuck, but then you risk losing the Blibber chip to your opponents. Also, if you blab using an incorrect sound, the other team gets your chip. Continue collecting Blibber chips and describing words to your teammates until the 60-second timer runs out. The team with the most Blibber chips at the end of the game wins.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/YA37YFFKgSY4j6zmhQahmDAej5Q=/fit-in/200x150/pic121087.jpg","image":"https://cf.geekdo-images.com/original/img/8TvpmRZkBAivCU39Y9PuaWnvepA=/0x0/pic121087.jpg","id":"22853","publishers":["Patch Products"],"categories":["Humor","Party Game","Word Game"],"mechanics":["Patch Products"],"designers":["(Uncredited)"]},{"yearpublished":2017,"minplayers":1,"maxplayers":6,"playingtime":20,"minplaytime":10,"maxplaytime":20,"age":10,"name":"Raise the Shields","description":"All six sectors of the province are under attack! Quick! Get those shields up now!<br/><br/>Raise the Shields is a print-and-play roll-and-write game of direct conflict. Seek to destroy your neighbor's cities while simultaneously working to erect shields in an effort to protect your own cities.<br/><br/>All players share two of the same dice while also rolling one personal dice. These three dice must be assigned to three different tasks:<br/><br/>     Work sector: Where will you work on connecting your shield generator to the power plant?<br/>     Shape: What shape will you fill in order to connect the generator with the power?<br/>     Attack: In what sector will you attack your neighbor?<br/><br/><br/><br/><br/>Use these basic actions to erect shields, to destroy neighboring cities, and to open up new bonus abilities.<br/><br/>Be the first to raise all your shields or destroy an enemy city and you win the game!<br/><br/><br/>    In the solo mode, instead of attacking other players, you will assign damage to yourself.<br/><br/><br/>&mdash;description from the designer<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/AzCe-PHO6I4xoHbYLnZdbjxYtig=/fit-in/200x150/pic3870154.jpg","image":"https://cf.geekdo-images.com/original/img/9mbPBxDKCNOIcZlk1VsLHYlRi5E=/0x0/pic3870154.jpg","id":"240425","publishers":["(Web published)"],"categories":["Abstract Strategy","Dice","Fighting","Print & Play"],"mechanics":["Dice Rolling","Paper-and-Pencil","Simultaneous Action Selection"],"designers":["Lucas Gerlach"],"artists":["Lucas Gerlach"]},{"yearpublished":2018,"minplayers":2,"maxplayers":9,"playingtime":240,"minplaytime":30,"maxplaytime":240,"age":14,"name":"Dragoonium","description":"A fantasy themed set matchin card game similar to rummy. Players try to collect the most gold by playing sets of matching cards during their turns. <br/>Each player plays as one of 9 Champions(colors), each one has different abilities that effect game play, and what cards are used to create the deck.<br/>Each hand follows a simple draw-play-discard pattern until someone runs out of cards, at which point gold (score) is counted.<br/><br/>&mdash;description from the publisher<br/><br/>","id":"237557","publishers":["Thorny Wench Game Studios"],"categories":["Card Game","Fantasy","Number"],"mechanics":["Thorny Wench Game Studios"],"family":["Admin: Unreleased Games","Crowdfunding: Kickstarter"]},{"yearpublished":1980,"minplayers":2,"maxplayers":6,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":10,"name":"Air Strike!","description":"Air combat in the 1980's. An extremely simple game (one tiny page of rules) in which the players command the air assets of sectors of a military front. Each has, typically, 15 to 30 planes of various types to allocate secretly to one of four missions (Scramble Ready, Ground Attack, Offensive Air Superiority, Defensive Air Superiority). The allocations are then revealed, and the players determine how many ground attacks succeeded and how many planes were shot down or damaged. Successful ground attacks score 5 victory points, downed planes 2 each.<br/><br/>Scenarios are provided for Germany (U.S. or U.K./Germans vs. USSR), the Mediterranean and the Middle East (Israel vs. Syria).<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/GD5oTdMmTrxpmX4t_9753HmJNB4=/fit-in/200x150/pic1597308.jpg","image":"https://cf.geekdo-images.com/original/img/DqgvEGSAScNHKS0tJP6Cqfp9A1I=/0x0/pic1597308.jpg","id":"119077","publishers":["Q-Games"],"categories":["Aviation / Flight","Modern Warfare"],"mechanics":["Q-Games"],"designers":["W. C. Likens"]},{"yearpublished":2015,"minplayers":2,"maxplayers":5,"playingtime":30,"minplaytime":20,"maxplaytime":30,"age":8,"name":"Loony Quest","description":"In the wonderful land of Arkadia, a very old king has no heir. He organizes a tournament to offer his throne to the bravest adventurer of the kingdom. Up to five finalists will wander seven worlds full of surprises...<br/><br/>In the drawing game Loony Quest, players study challenging level cards, then try to replicate the outline to meet targets and avoid obstacles on their tracing sheets. Once finished, players place their sheets on top of the level card to see whether the drawings line up with the targets they meant to hit &mdash; or avoid. Largely inspired by video games, Loony Quest players discover various worlds, play with 3D and 2D levels, run into loony monsters &mdash; Loonies &mdash; and big bosses, trigger special stages, collect bonuses, use penalties on opponents, and gather as many Xperience points as possible to win.<br/><br/>Loony Quest features the same basic gameplay as in Doodle Quest, but has been developed differently by the publisher.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/Di5n6qrA1rBqsEIZsI9dB5W4UH4=/fit-in/200x150/pic3043308.jpg","image":"https://cf.geekdo-images.com/original/img/abp_2EVOj6Sl2B54Xi9JC73Ij64=/0x0/pic3043308.jpg","boardgameaccessory":{"_attributes":{"objectid":"205631"},"_text":"Loony Quest: Token storage"},"id":"136991","publishers":["Libellud","Broadway Toys LTD","Galápagos Jogos","Gém Klub Kft.","Lautapelit.fi","Rebel"],"categories":["Action / Dexterity","Fantasy","Real-time"],"mechanics":[null],"designers":["Laurent Escoffier","David Franck"],"artists":["Paul Mafayon"],"family":["Loony Quest"],"expansions":["Brettspiel Adventskalender 2015","Loony Quest: Bonusplättchen Skier","Loony Quest: Christmas Promo","Loony Quest: The Lost City"]},{"yearpublished":2009,"minplayers":3,"maxplayers":7,"playingtime":180,"minplaytime":180,"maxplaytime":180,"age":13,"name":"Battlestar Galactica: The Board Game – Pegasus Expansion","description":"The first expansion for Battlestar Galactica: The Board Game, Pegasus adds two new supplemental game boards featuring the Battlestar Pegasus and the planet New Caprica, seven new characters, two plastic Basestars, as well as new Destination, Crisis, Loyalty, Quorum, Super Crisis, and Skill cards.<br/><br/>The new Pegasus board can be used by itself or together with the New Caprica board to create the game you desire &ndash; the Pegasus alone for the additional firepower she provides, or add the New Caprica board to simulate the rebellion on the new human colony, bringing the game to an epic level.<br/><br/>New rules introduce the ability to play as a new character type &ndash; the Cylon Leader, with a new Treachery Skill card type.<br/><br/> From the Box: <br/>&quot;On behalf of the officers and crew of the Pegasus, it's a pleasure to see you all. Welcome back to the Colonial Fleet.&quot; - Admiral Helena Cain<br/><br/>The arrival of the Battlestar Pegasus heralds a new era in the lives of the Galactica crew and the Colonial government, bringing badly needed manpower and firepower to humanity's ongoing fight against the Cylons. However, under the command of Admiral Cain there is no place for compassion or mercy. Now brutal necessity and hard choices erode humanity's moral compass. The Cylons, in turn, are changing as well. The more they are exposed to humans, the more their individual agendas begin to guide their actions. In a time of suspicion and desperate need, the line between right and wrong grows less and less distinct.<br/><br/>The Pegasus Expansion for Battlestar Galactica: The Board Game brings players the next chapter in the popular Syfy series. In addition to more Destination, Crisis, Super Crisis, Loyalty, and Skill Cards, this expansion introduces many new card types such as Treachery Skill Cards, representing the underhanded methods used to sabotage humanity's struggles. New characters in the expansion allow players to play as Cylon Leaders, who can win or lose based on their own mysterious motivations. New gameboards allow characters to explore both the Pegasus and New Caprica. Finally, with the New Caprica Objective Card and board, humanity will be subjected to Cylon rule, and must defend themselves from their oppressive overlords until Galactica can return to attempt a daring rescue.<br/><br/>&quot;We fight 'em until we can't.&quot; - Kara Thrace<br/><br/>Expands:<br/><br/><br/>    Battlestar Galactica: The Board Game<br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/24VuBbBkNd8UYr0whNF-Np1xpp4=/fit-in/200x150/pic512021.jpg","image":"https://cf.geekdo-images.com/original/img/ZaoqzdwMSiDQoSWuEvZfYHMMaoU=/0x0/pic512021.jpg","boardgameaccessory":{"_attributes":{"objectid":"233523"},"_text":"Battlestar Galactica: Galactic Intrigue Organizer"},"id":"43539","publishers":["Fantasy Flight Games","Edge Entertainment","Galakta","Game Harbor","Heidelberger Spieleverlag","Stratelibri"],"categories":["Bluffing","Deduction","Expansion for Base-game","Movies / TV / Radio theme","Political","Science Fiction","Space Exploration","Spies/Secret Agents"],"mechanics":["Dice Rolling","Hand Management","Partnerships","Role Playing","Variable Player Powers"],"designers":["Daniel Clark (I)","Corey Konieczka","Tim Uren"],"artists":["Andrew Navaro","Zoe Robinson","Brian Schomburg"],"family":["Battlestar Galactica"],"expansions":["Battlestar Galactica: The Board Game"]},{"yearpublished":2018,"minplayers":2,"maxplayers":2,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":12,"name":"Shields Up!","description":"In Shields Up players race to destroy the opponents shields and ship. Captains take 2 actions each turn, choosing to either draw or play cards. Assemble sets of cards in order to activate weapons and other equipment.<br/><br/>As captain of your ship you can place any card face down as a shield. A ship can have up to 3 shield cards. Destroy your opponent&rsquo;s shield and do at least 1 additional damage to destroy their ship and win the battle!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/Jf2keMnzzaOP9K2C2apVK_ajHns=/fit-in/200x150/pic4110544.png","image":"https://cf.geekdo-images.com/original/img/lIbREW27xiI6fUoeSjZ_PIZdho4=/0x0/pic4110544.png","id":"247144","publishers":["Concrete Canoe Games"],"categories":["Concrete Canoe Games"],"mechanics":["Hand Management","Set Collection"],"designers":["Patrick McNeil"]},{"yearpublished":1997,"minplayers":2,"maxplayers":4,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":4,"name":"Tri-Ominos Junior","description":"This kids version of Tri-ominos uses animals on the tiles. The tile with three &quot;five ducks&quot; is used to start the game. Players must play a tile that exactly matches the edge of the tile its placed against. If you cannot make a match, you must pull from the draw pile until you find a tile that does match. The first player to match of all their tiles wins.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/4bh4_9C67tjsloyDuS0IsUUFrw4=/fit-in/200x150/pic524750.jpg","image":"https://cf.geekdo-images.com/original/img/m8wnS-j6f6MNmqO3PBTzW6yenRc=/0x0/pic524750.jpg","id":"13368","publishers":["Pressman Toy Corp."],"categories":["Animals","Children's Game"],"mechanics":["Pattern Recognition","Tile Placement"],"designers":["(Uncredited)"],"family":["Dominoes","Tri-Ominos","Triangular Dominoes"]},{"yearpublished":2008,"minplayers":3,"maxplayers":8,"playingtime":20,"minplaytime":20,"maxplaytime":20,"age":6,"name":"Pinguini contro Vampiri","description":"Presented at Play 2008 in Modena (Italy), Pinguini Contro Vampiri is a very simple game with rules similar to Uno. The game was sponsorized by AVIS (Associazione Volontari Italiani Sangue), the most important Blood Donors association in Italy, and the objective of the game is educate children to the importance of blood groups.<br/><br/>It contains 55 cards: 48 Penguin cards and 7 Vampire cards.<br/><br/>The first player plays a Penguin card, that shows a blood group and all related blood groups. Following player should play a related card (with the same symbol), otherwise comes in Play a Vampire card, that lightly modify the rules of the game.<br/><br/>If one player has no cards, the game ends and all players has won. If the last Vampire is played, the game ends and all players have lost.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/URhN7UHtz_wt2uXliikliO4nlds=/fit-in/200x150/pic1211305.jpg","image":"https://cf.geekdo-images.com/original/img/rg91ZX3GEaSnGSrEHSmhvoFhEPg=/0x0/pic1211305.jpg","id":"117670","publishers":["AVIS - Associazione Volontari Italiani Sangue"],"categories":["Card Game","Children's Game"],"mechanics":["AVIS - Associazione Volontari Italiani Sangue"],"designers":["Francesco Berardi","Paolo Mori"],"artists":["Pino Ligabue"],"family":["Animals: Penguins","Promotional Board Games","Vampires"]},{"yearpublished":0,"minplayers":2,"maxplayers":5,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":10,"name":"Crossbones: The Swashbuckling Pirate Adventure Game","description":"A pirate's life adventure tale...<br/><br/>Crossbones: The Swashbuckling Pirate Adventure Game is designed for 2-5 players, ages 10 to adult, with a play time of approximately 30 to 45 minutes.<br/><br/>Introduction<br/><br/>Avast, me hearties! Tis yer discovery of a treasure map that beckons ye and yer mates on a swashbuckling pirate adventure. Ye shall set sail in search of gold, silver, jewels and other treasures... yet beware of stormy weather, ruthless pirates, and other misfortunes that await ye!<br/><br/>Gameplay Overview<br/><br/>Crossbones: The Swashbuckling Pirate Adventure Game ~ A pirate's life board game where players take on the role of pirate captains that race against each other to become the first and most infamous pirate to complete an adventure tale. Pirate captains advance through the adventure by a rolling a variety of dice to complete a series of event challenges or by seeking tactical opportunities to plunder.<br/><br/>Throughout the adventure, Captains may navigate their ship to explore for cargo and/or plunder for booty to boost their reputation and crew morale... yet, a limited supply of rum and cannonballs will require each captain to manage their progress and piracy accordingly to maintain a tactical range of attack or defense in their movement. And, like any good pirate adventure, Captains may just find something more than other seafaring souls cursing the waters... so, keep a weather eye on the horizon an' beware the trance of mermaids or Kraken attacks.<br/><br/>Now... ready yer sails... man yer cannons... an' ne'er give up the hunt fer treasure!<br/><br/>Join our crew!<br/><br/>&quot;The only way for a pirate to make a living these days is by betraying other pirates.&quot;<br/><br/>~ Barbossa<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/kG1cc3oBc6Xy93641owzu5giRPI=/fit-in/200x150/pic1730200.jpg","image":"https://cf.geekdo-images.com/original/img/iaxmCtvrx_ok3JKaeB07sTYhAJ4=/0x0/pic1730200.jpg","id":"102912","publishers":["(Unpublished)","Dice Roll Games"],"categories":["Adventure","Dice","Exploration","Nautical","Pirates","Racing"],"mechanics":["Dice Rolling","Set Collection"],"designers":["Tom Razo"],"family":["Crowdfunding: Kickstarter"]},{"yearpublished":2016,"minplayers":2,"maxplayers":2,"playingtime":15,"minplaytime":15,"maxplaytime":0,"age":12,"name":"Hakoniwa no kuni \"The Reclamation\"","description":"User summary<br/>箱庭の国 &quot;The Reclamation&quot; (Hakoniwa no kuni &quot;The Reclamation&quot;) (in English The Land of Miniascape &quot;The Reclamation&quot;).<br/><br/>Hakoniwa no Kuni is a two-player game with a theme of flower-growing in an enchanted garden. In a 6x6 square grid, two gardeners move, grow their flowers, and shorten opponent's flowers.<br/><br/>Each turn, you move your gardener to adjacent square, and play a reclamation card. A reclamation card indicates squares to be reclaimed. You may grow your flowers and/or shorten opponent's flowers in these squares.<br/><br/>This game has two modes of play, and each mode has specific victory conditions, such as to occupy 12 squares with your flowers. You win the game when you fulfill the victory condition, or forcing your opponent unable to move or reclaim.<br/><br/>The flower components are hand-made by the designer, formed in clay and baked in an oven.<br/><br/>The first edition was published in May 2016 for the Tokyo Game Market (TGM). The second edition, published in December 2016 for TGM, includes another set of rules in addition to the first edition's rules.<br/><br/>The first edition's rules descriptions in the rulebook are slightly adjusted, but its rules are basically passed down as is to the second edition.<br/><br/>Publisher's summary<br/>「箱庭の国」は、魔法にかけられた花たちの庭園を舞台にした二人用ボードゲームです。<br/>手番では、プレイヤーは「庭師」と呼ばれる駒を移動させ、手元のカードを使って「開拓」アクションを実行します。<br/>その結果、「庭師」を中心としたボード上の一定範囲に自分の石が置かれて陣地となり、逆に相手の石は取り除かれていきます。<br/>このゲームでは、「庭師」も陣地も積み上げられた石で表現されており、局面は同じ形状をした石の裏表と積み重ねのみによって形作られます。<br/>陣地を12マス得る、相手の「庭師」を無力化するなどの条件を満たしたとき、ゲームに勝利します。<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/yNK04Oqrszu46KQeoOhHhn0Kcp4=/fit-in/200x150/pic3324346.jpg","image":"https://cf.geekdo-images.com/original/img/W8A1UUUe4_HJopxAdmpjFgc-nC4=/0x0/pic3324346.jpg","id":"217196","publishers":["Kuuri Keikaku (空理計画)"],"categories":["Abstract Strategy","Farming"],"mechanics":["Campaign / Battle Card Driven","Grid Movement","Hand Management"],"designers":["Hakushi (はくし)"],"artists":["Hakushi (はくし)"]},{"yearpublished":2014,"minplayers":1,"maxplayers":8,"playingtime":10,"minplaytime":1,"maxplaytime":10,"age":6,"name":"Magische Geschichten Würfel","description":"Roll all eight dice or roll them one at a time. Weave your pirate story together using the figures on each die. If you roll the red superpower symbol, you may add a special ability to your character.<br/><br/>Each player can tell a story just for fun, or take turns telling a story from the same dice, and vote for the best-told story. The game is designed primarily for language-learners.<br/><br/>Excitement, adventure and super powers: these dice bring fun into every story! Let them inspire you on a daring pirate adventure story. And with some luck, the dice even give your hero super powers!<br/><br/>There are no limits to your imagination ...<br/><br/>~~~~~<br/><br/>Spannung, Abenteuer und Super-Kr&auml;fte: Diese W&uuml;rfel bringen Pepp in jede Geschichte! Lass dich von ihnen zu einer verwegenen Piraten-Abenteuer-Geschichte inspirieren. Und mit etwas Gl&uuml;ck verleihen die W&uuml;rfel deinem Helden sogar Super-Kr&auml;fte!<br/><br/>Deiner Phantasie sind keine Grenzen gesetzt ...<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/kTlueeMYQKHIaxS-UGBGmFytWug=/fit-in/200x150/pic3548074.jpg","image":"https://cf.geekdo-images.com/original/img/DLYT39GEAIa4o8dyFI41LdUb53E=/0x0/pic3548074.jpg","id":"225966","publishers":["Laurence King Publishing Ltd","Magma Éditions","moses. Verlag GmbH"],"categories":["Children's Game","Dice","Party Game","Pirates"],"mechanics":["Dice Rolling","Storytelling"],"designers":["Inca Starzinsky"],"artists":["Hannah Waldron"]},{"yearpublished":0,"minplayers":2,"maxplayers":4,"playingtime":10,"minplaytime":10,"maxplaytime":10,"age":7,"name":"Pignus Mania","description":"Description: Pignus Mania is a game of strategy and logic that defies the limits of human reasoning. An incredible mental battle with a single purpose: to isolate the white part in the game!<br/><br/>Description translated from: <a target='_blank' href=\"http://www.apm.pt/portal/index_loja.php?id=162602\" rel=\"nofollow\">http://www.apm.pt/portal/index_loja.php?id=162602</a>, similar description in the box.<br/><br/>The board is filled with tetraeder-shaped pieces in 4 colors and 1 white piece. The spaces are connected with lines in all directions (horzontal, vertical, diagonal). The aim of the game is to be the player to isolate the white piece. To do so, players alternate picking a line and a color and remove all pieces of that color from the line.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/X6810FxTrXYE-j0ZPl0koQqwbb4=/fit-in/200x150/pic810143.jpg","image":"https://cf.geekdo-images.com/original/img/sNn9-w2N88prHhvanFKlNmQEByo=/0x0/pic810143.jpg","id":"75815","publishers":["Eudactica"],"categories":["Eudactica"],"mechanics":["Eudactica"],"designers":["Bruno Proença"]},{"yearpublished":2007,"minplayers":3,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Army For Sale","description":"From the designer's site:<br/><br/>&quot;A bidding/military conquest game for 3 or 4 players. Recruit the best officers to lead your armies in Part I of the game, then choose how to deploy them in a battle for Europe in part II. Medici &reg; players will love the myriad of factors that influence the bidding, and fans of Stratego &reg; will appreciate the familiar officer corps.&quot;<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/nfTRjzbMcL6G2oH_VV31PDoAlC0=/fit-in/200x150/pic1003167.png","image":"https://cf.geekdo-images.com/original/img/HC5sbnUtWR1HuYzp4iqlvxWCnBE=/0x0/pic1003167.png","id":"40033","publishers":["(Self-Published)"],"categories":["Bluffing","Wargame"],"mechanics":["Auction/Bidding","Hand Management","Simultaneous Action Selection"],"designers":["Harris Dvores"]},{"yearpublished":2018,"minplayers":2,"maxplayers":4,"playingtime":60,"minplaytime":20,"maxplaytime":60,"age":14,"name":"Vs System 2PCG: Spider-Friends","description":"The first installation of the Great Power Arc.<br/><br/>Even Super Heroes could use a little help from their friends from time to time. Spider-Man is fortunate to have an amazing array of friends and allies to help him in this latest expansion to Vs. System 2PCG. Look for a variety of spectacular supporting characters from Black Cat to Aunt May! This set also includes an infamous black suit, that while a bit too clingy, does offer some new abilities and Symbiote equipment to our friendly neighborhood Spider-Man.<br/><br/>Vs. System 2PCG: Spider-Friends showcases 55 new cards that are centered on the webslinger and his friends. Including Main Characters, Supporting Characters, Plot Twists, and a Special Location. Vs System 2PCG: Spider-Friends can be combined with any other Vs System 2PCG sets.<br/><br/>This is not a stand-alone game.<br/><br/>-description from publisher<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/engTyFxM1p0JYTSwIc7tbsfmwPs=/fit-in/200x150/pic4286164.png","image":"https://cf.geekdo-images.com/original/img/__b5pAcblj4rlyuhI5A1bFA49UI=/0x0/pic4286164.png","id":"258360","publishers":["Upper Deck Entertainment"],"categories":["Card Game","Comic Book / Strip","Expansion for Base-game","Fighting"],"mechanics":["Hand Management","Variable Player Powers"],"designers":["Ben Cichoski","Daniel Mandel"],"family":["Comics: Marvel Universe","Superheroes","Vs System 2PCG"],"expansions":["Vs System 2PCG: The Alien Battles","Vs System 2PCG: The Marvel Battles","Vs System 2PCG: The Predator Battles"]},{"yearpublished":1992,"minplayers":2,"maxplayers":0,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Catcher Quartett","description":"This card game is a traditional Quartett game using the picture cards but it also has a second game that uses the backs of the cards. This game is called Catcher Quartett and is only for two players.<br/><br/>Each card has a wrestling move on it.The four moves are Press, Pin, Drop Kick and Body Slam.<br/><br/>Each player is dealt half the deck. Both players choose a card secretly and then both cards are revealed simultaneously. If they are not the same, the following applies:<br/><br/>PRESS beats PIN<br/>PIN beats BODY SLAM and DROP KICK<br/>DROP KICK beats PRESS<br/>BODY SLAM beats DROP KICK and PRESS<br/><br/>The strongest card takes the weaker card. Play continues until all the cards are used and the player with the most cards wins. If you want a longer game you can continue until one player has won all the cards.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/lGWOSWTA-jOQVHCIYihTqPF7bsU=/fit-in/200x150/pic1577683.jpg","image":"https://cf.geekdo-images.com/original/img/5AIQ6Ij_e1WDs-oB-7zb4j5jOR0=/0x0/pic1577683.jpg","id":"138572","publishers":["AMIGO"],"categories":["Card Game","Children's Game","Sports"],"mechanics":["Rock-Paper-Scissors","Set Collection"],"family":["Sports: Wrestling"]},{"yearpublished":2017,"minplayers":2,"maxplayers":6,"playingtime":20,"minplaytime":10,"maxplaytime":20,"age":5,"name":"Gute Nacht Monster","description":"Okay, don't panic now, but monsters are lying underneath your bed. You're quite sure of this because you've seen them first-hand &mdash; but wait? How many were there? What color were they? And couldn't some of them actually have been teddy bears?<br/><br/>In Gute Nacht Monster, players roll six dice each round, with the dice showing monsters and teddy bears in three different colors. All players need to remember these dice as quickly as they can because the dice then disappear under the bed and a task card is revealed, with players being asked, for example, how many green monsters are present. All players answer in secret, and whoever is correct moves their figure one step closer to the light switch. Whoever manages to turn on the light wins!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/4YToAtvUIi1HVg9ycQBm6grVcRs=/fit-in/200x150/pic3518081.jpg","image":"https://cf.geekdo-images.com/original/img/_VgkPs48-i2_dtTrZXOpXX1Z5wE=/0x0/pic3518081.jpg","id":"219195","publishers":["Pegasus Spiele"],"categories":["Pegasus Spiele"],"mechanics":["Dice Rolling","Memory"],"designers":["Hartwig Jakubik"],"artists":["Anne Pätzke"],"family":["Pegasus Children's Games"]},{"yearpublished":2003,"minplayers":3,"maxplayers":5,"playingtime":10,"minplaytime":10,"maxplaytime":10,"age":6,"name":"Mücke mit Tücke","description":"M&uuml;cke mit T&uuml;cke features cards with animals, the sound that they make (in German), a value, and sometimes a mosquito. Players take turns revealing cards from their deck in front of them. If a number or a value matches a card already visible, the two (or more) players who match have to speak the &quot;other&quot; before their opponent. If a Donkey-3 is revealed, and another player already has a Cat-3 showing, the player with the donkey card will want to say &quot;Miow&quot; before the player with the Cat card says &quot;i-ah&quot;. If the animals matched, they would want to say the opponent's numeric value. The winner gets their opponent's faceup<br/>cards, adds them to his own, and then shuffles them into their draw deck. There is also a slap jack element; there are hand cards that when revealed, cue players to slap the highest-value card showing a mosquito. The winner gets ALL face-up cards. Once a player runs out of cards, the person with the most cards is the winner.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/GTPVAJ331Gw9zGmllanzAS6oNp8=/fit-in/200x150/pic57883.jpg","image":"https://cf.geekdo-images.com/original/img/OXj_XOrC3ac7kYZck40LPy9T0XI=/0x0/pic57883.jpg","id":"8262","publishers":["Nürnberger-Spielkarten-Verlag","Oya"],"categories":["Animals","Card Game","Children's Game","Real-time"],"mechanics":[null],"designers":["Frank Stark"],"artists":["Theiss Heidolph","Frank Stark"],"family":["Animals: Flies","Tolle Kleine"]},{"yearpublished":2015,"minplayers":2,"maxplayers":6,"playingtime":120,"minplaytime":60,"maxplaytime":120,"age":10,"name":"Modern Land Battles: Target Acquired","description":"Description from the publisher:<br/><br/>Modern Land Battles (MLB): Target Acquired uses the core game mechanisms from our award-winning Modern Naval Battles game. MLB takes you to the front lines in both historical and hypothetical conflicts ranging from the Arab-Israeli Wars to the present day.<br/><br/>This new game features armor, infantry and artillery vehicles from 7 different nations: USA, USSR, UK, China, Israel, Insurgent, and Arabian Multinational. This gives you the forces you need to play out battles during the Cold War, Six-Day War, Iran-Iraq War, Vietnam War, Lebanon War, Yom Kippur War, Falkland Islands War, and Gulf War.<br/><br/>The game system maximizes player decision making to make every turn exciting. At the start of the game, you get to select a nation's ground forces to command. Then, you get to select the specific armor, infantry, and artillery forces that you think is the best battle force. Once selected, you'll get to battle the forces selected by the other players in order to capture and secure vital objectives!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/0AjB4QQdLgyOWiS_Y-aPHCuhtKo=/fit-in/200x150/pic402322.jpg","image":"https://cf.geekdo-images.com/original/img/OMziLmehI-NDTU-XyUUz7n1_RHI=/0x0/pic402322.jpg","id":"37491","publishers":["Dan Verssen Games (DVG)"],"categories":["Card Game","Dice","Fighting","Modern Warfare","Vietnam War","Wargame"],"mechanics":["Card Drafting","Dice Rolling"],"designers":["Dan Verssen"]},{"yearpublished":2013,"minplayers":2,"maxplayers":2,"playingtime":25,"minplaytime":25,"maxplaytime":25,"age":10,"name":"Invictus","description":"Invictus &ndash; Latin, meaning &ldquo;unconquered&rdquo;.<br/><br/>2 player abstract game played on the spaces of a 9x9 board.<br/>Each player has 18 dice pieces, one set black the other white.<br/><br/>Setup<br/>Place the 9x9 board between the players.<br/><br/>Next, players turn 3 of their 18 dice pieces so that the top faces show all ones then 3-twos, 3-threes, 3-fours, 3-fives and 3-sixes.<br/><br/>Now Black sets his dice pieces onto any space of the second and third rows of the board that are closest to him, then White does the same.<br/><br/>Object<br/>Player with the highest score at games end, wins.<br/><br/>Play<br/>The fifth row of the board is known as the Divide and divides the board into two territories.<br/><br/>One player plays black the other white.<br/><br/>Black moves first, then play alternates.<br/><br/>On your turn you must take one of two actions:<br/><br/>1.Move a die one space either forward, left, right or diagonally forward, never backwards onto an empty space.<br/>2.Capture a die one space diagonally forward, like a pawn in chess performing a capture.<br/><br/>When any friendly dice reach an opponent&rsquo;s first row, they are removed from play and used in scoring at endgame.<br/><br/>Captures<br/>A friendly die may only capture an opponent&rsquo;s die of equal face value or less, the captured die is returned to your opponent if its face value is greater than one. On receiving the captured die from your opponent you must turn that die so that the face value of the die now reads one less, then place this die onto an empty space on your side of the Divide.<br/><br/>Any captured dice that have a face value of (1) are removed from play and kept for scoring at endgame.<br/><br/>The game ends when a player moves all of his remaining dice onto his opponent&rsquo;s first row.<br/><br/>If any of your opponents dice are past the Divide and in your territory at endgame they will be added to your opponents score.<br/><br/>Score <br/>Add up all of the top face values of your dice that reached you&rsquo;re opponents first row, any captured dice and any of your dice that were within enemy territory.<br/><br/>Highest score wins!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/qEZaHo18L-djkjFJjc4msfxi_4g=/fit-in/200x150/pic1821094.png","image":"https://cf.geekdo-images.com/original/img/e7WiJxcXKNYPDS4yUaDwmGKToVo=/0x0/pic1821094.png","id":"149778","publishers":["(Web published)"],"categories":["(Web published)"],"mechanics":["(Web published)"],"designers":["Rey Alicea"],"artists":["Rey Alicea"]},{"yearpublished":2017,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Tales of the Borrowers","description":"A card game based on the Borrowers, the tiny people that live hidden in our houses and borrow only what they need.<br/><br/>Players share a common deck comprising 10 cards of each of 7 card types: Places, Threats, Escapes, Friends, Foods, Objects, and Tools. Players start with a hand of 7 cards.<br/><br/>Players take turns with each turn comprising 3 phases:<br/><br/>1.   Draw Phase<br/>-    Draw Cards from the deck to fill your hand to 7 cards.<br/><br/>2.   Action Phase<br/>-    You may discard 1 card for its effect: <br/>&bull;    Places = Discard 1 more card and draw 2 cards<br/>&bull;    Threats = Opponent discards 1 random card from hand <br/>&bull;    Escapes = Steal 1 random card from an opponent&rsquo;s hand<br/>&bull;    Friends = Give this card to opponent and draw 2 cards<br/>&bull;    Foods = Draw 1 card<br/>&bull;    Objects = Put any card from the discard into your hand<br/>&bull;    Tools = Discard hand and draw 7 new cards<br/><br/>3.   Meld Phase<br/>-    You may make a meld of 7 cards of one of the following 10 types:<br/>&bull;    Borrower&rsquo;s Feast: 3 Friends + 4 Foods<br/>&bull;    Dangerous Journey: 3 Places + 2 Escape + 2 Threats<br/>&bull;    Monty Haul: 3 Objects + 2 Tools + 2 Foods<br/>&bull;    Friendly Visit: 2 Friends + 3 Places + 2 Escapes<br/>&bull;    Great Adventure: 1 of each Type<br/>&bull;    Tricks of the Trade: 3 Tools + 4 Escapes<br/>&bull;    Home and Hearth: 4 Objects + 3 Foods<br/>&bull;    Full House: 4 Friends + 3 Objects<br/>&bull;    A Big Scary World: 4 Threats + 3 Places<br/>&bull;    Weapons of Choice: 4 Tools + 3 Threats<br/>-    You cannot make a meld of a type already made this game. <br/>-    If you complete a meld discard your hand and draw 7 new cards. <br/>-    If you don&rsquo;t have a meld, you must discard your hand down to 6 cards.<br/><br/>The winner is the first player to complete 3 melds.<br/><br/>","id":"231969","publishers":["Warp Spawn Games"],"categories":["Card Game","Movies / TV / Radio theme","Print & Play"],"mechanics":["Card Drafting","Set Collection"],"designers":["Lloyd Krassner"]},{"yearpublished":2017,"minplayers":1,"maxplayers":5,"playingtime":120,"minplaytime":90,"maxplaytime":120,"age":12,"name":"Terraforming Mars: Venus Next","description":"Terraforming Mars: Venus Next, the second expansion for the Terraforming Mars base game, has players building flying cities and making the atmosphere more hospitable on the deadly planet Venus.<br/>In Venus Next, the World Government chooses to also fund the terraforming of Venus. Around 50 project cards and 5 corporations are added, with a special focus on how to make Venus habitable. With the new floater resource, a new milestone, a new award, a new tag, and a new terraforming parameter, players are given more paths to victory and an even more varied play.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/gVyc29X12Y-NORiv5GSkIrPdWVM=/fit-in/200x150/pic3767139.jpg","image":"https://cf.geekdo-images.com/original/img/bHKxDPfx0blBHYQXdp9ssomsa0Q=/0x0/pic3767139.jpg","boardgameaccessory":{"_attributes":{"objectid":"263728"},"_text":"Terraforming Mars: Folded Space Insert"},"id":"231965","publishers":["FryxGames","Ghenos Games","Intrafin Games","Lavka Games","Maldito Games","Meeple BR Jogos","MINDOK","Rebel","Reflexshop","Schwerkraft-Verlag","Stronghold Games"],"categories":["Economic","Educational","Environmental","Expansion for Base-game","Industry / Manufacturing","Science Fiction"],"mechanics":["Card Drafting","Hand Management","Tile Placement"],"designers":["Jacob Fryxelius"],"artists":["Isaac Fryxelius"],"family":["Fryxgames' Future Timeline","Planets: Mars","Planets: Venus","Solar System","Solitaire Games","Terraforming Mars"],"expansions":["Terraforming Mars"]},{"yearpublished":1939,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Gulliver's Travels","description":"&quot;The Game of Little Men and Giant Fun&quot;<br/><br/>Spin and move around a board and recreate the adventures made famous by Jonathan Swift.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/kyZe4pBawjDZd2RCDg4i3DBPgdQ=/fit-in/200x150/pic489942.jpg","image":"https://cf.geekdo-images.com/original/img/D4h3P8mHH9yVN6z0J37Fm4vYjTg=/0x0/pic489942.jpg","id":"43051","publishers":["Milton Bradley"],"categories":["Adventure","Children's Game"],"mechanics":["Milton Bradley"],"designers":["(Uncredited)"]},{"yearpublished":1963,"minplayers":2,"maxplayers":8,"playingtime":1,"minplaytime":1,"maxplaytime":1,"age":0,"name":"Auteuil","description":"This old French game simulates Steeple-Chase horse races. On his turn, each player throws three dice and chooses which one among the eight horses he will advance toward the finish line, in order to match his secret bets<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/xGyeC6wCI6GVmBOW-5gQd91TiHg=/fit-in/200x150/pic55463.jpg","image":"https://cf.geekdo-images.com/original/img/T2ULw5ucWRx9KHXUa8VBNrp9Mmk=/0x0/pic55463.jpg","id":"13736","publishers":["Dujardin"],"categories":["Bluffing","Racing"],"mechanics":["Betting/Wagering","Roll / Spin and Move"],"designers":["Edmond Dujardin"],"artists":["J. C. Rèche"],"family":["Sports: Horse Racing"]},{"yearpublished":1948,"minplayers":2,"maxplayers":6,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":0,"name":"Oscar: The Film Star's Rise to Fame","description":"Oscar is a board game based on the &quot;golden age of cinema&quot;.  The players take the role of actors and actresses trying to become Hollywood stars and win an Academy Award.  Players advance by collecting money and assets, avoiding setbacks and win the game by winning the Oscar.<br/><br/>The game contents: <br/>1 game board<br/>15 cardboard character pieces that can be inserted into the plastic playing pieces <br/>6 different colored plastic playing pieces<br/>Paper money<br/>Casting cards<br/>Fortune cards<br/>Asset cards<br/>Loan cards<br/>1 standard six sided die<br/>1 colored die with each side matching the color of one of the 6 playing pieces<br/>1 plastic Oscar bust<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/nmiGLt4ubYjhgj4cwdRw302Zp4Q=/fit-in/200x150/pic100400.jpg","image":"https://cf.geekdo-images.com/original/img/N1qlWHkjTnKT5cZUBRdhnG8Tetw=/0x0/pic100400.jpg","id":"17330","publishers":["Perry & Co. Ltd."],"categories":["Dice","Movies / TV / Radio theme"],"mechanics":["Dice Rolling","Roll / Spin and Move"],"designers":["(Uncredited)"]},{"yearpublished":0,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":0,"name":"Timo Taikuri Taikanoppapeli","description":"This game is based on a popular Finnish childrens showcfrom the 80's. In this roll and move game your goal is to travel from start to finish making magic tricks and collecting magic wands alond the way. Magic tricks are determined by dice rolls. The winner is the one who has the most magic wands.<br/><br/>","id":"245511","publishers":["Paletti"],"categories":["Paletti"],"mechanics":["Dice Rolling","Roll / Spin and Move"]},{"yearpublished":2014,"minplayers":3,"maxplayers":6,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":12,"name":"Obsession for Murder","description":"You and the other players are patrons at a strange and bizarre open market. You are all are here to indulge in your obsessions, whether they be artifacts, guns, or art. Vendors display their wares of various shapes, sizes, and legality. You wander up and down the aisles, searching for that which strikes your fancy. Suddenly, you hear a scream, and see the body. Somebody has been murdered! There is a killer on the loose, and they will stop at nothing to get their hands on what they want.<br/><br/>In Obsession for Murder, players have secret identities that determine what types of Items that player wants to collect. One of these identities is The Murderer, who tries to eliminate the other players and be the only player left. The other players, while attempting to collect their chosen items, can also accuse each other of being The Murderer. If they are correct, they win. If they are wrong, the accused is lynched, and play continues until the Murderer wins or is correctly accused.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/3YdADq4lQ-tZyLwLpc-eKXXEjfc=/fit-in/200x150/pic3913157.jpg","image":"https://cf.geekdo-images.com/original/img/ghvgqqXZKjiLExtWikc1faaDZ2k=/0x0/pic3913157.jpg","id":"171853","publishers":["The Game Crafter, LLC","WHE Games"],"categories":["Bluffing","Card Game","Deduction","Murder/Mystery"],"mechanics":["Cooperative Play","Player Elimination","Set Collection","Trading"],"designers":["Robert Oliver Henderson IV"]},{"yearpublished":1982,"minplayers":2,"maxplayers":4,"playingtime":180,"minplaytime":180,"maxplaytime":180,"age":12,"name":"Soldier King","description":"&quot;Soldier King is a game for two to four players covering the war of succession in a leaderless empire. Each player controls one army and must struggle through diplomacy and conquest to capture a majority of the Imperial electoral cities, thus assuring his election as Emperor.&quot;<br/><br/>&quot;Movement of armies is from point to point along roads and waterways, thus emphasizing the key role played by lines of communications in the 1700's, the age of the soldier kings.  Each turn covers one season of campaigning, and each unit presents 10,000-20,000 troops.  Infantry, light cavalry and heavy cavalry units perform their own key rols in battle, and a system of promoting units after battles allows for a gradual improvement of armies from green levies to battle-hardened guards&quot; (from box back)<br/><br/>Containing: <br/>two 17x22 maps, 320 die cut counters, rules &amp; 2 dice<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/zvyovKanUSX-olqU7rEGCyK6V1g=/fit-in/200x150/pic15812.jpg","image":"https://cf.geekdo-images.com/original/img/v0Wzu3criPKEubTN-XWHdSA5f3U=/0x0/pic15812.jpg","id":"4794","publishers":["GDW Games"],"categories":["Negotiation","Wargame"],"mechanics":["GDW Games"],"designers":["Frank Chadwick"]},{"yearpublished":2008,"minplayers":2,"maxplayers":2,"playingtime":15,"minplaytime":15,"maxplaytime":15,"age":0,"name":"Palago","description":"Palago is a tile placement game in which players strive to form closed groups of their colour. Two players, White and Blue, share a common pool of 48 hexagonal arch tiles. Each tile contains a white arch and a blue arch, and may be oriented in three ways such that the corner colours are the same for each rotation.<br/><br/>White starts by placing two adjacent tiles, then players then take turns adding two adjacent tiles such that edge colours match neighbouring tiles.<br/><br/>The game is won by the player who forms a surrounded island of their colour containing at least one arch. If a move forms winning groups for both players, then the mover loses.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/OYzYsBKfRhdTjcODf9psUY17SKw=/fit-in/200x150/pic2407343.png","image":"https://cf.geekdo-images.com/original/img/AEAWLGzm8ZQUZ5H2vLorh6BB4LA=/0x0/pic2407343.png","id":"38462","publishers":["(Web published)","Colour of Strategy, Ltd.","Grapet","quecke-verlag"],"categories":["Abstract Strategy","Print & Play"],"mechanics":["Pattern Building","Tile Placement"],"designers":["Cameron Browne"],"artists":["Cameron Browne","Mike McManaway"],"family":["Combinatorial"]},{"yearpublished":2013,"minplayers":1,"maxplayers":5,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":10,"name":"Fanhunter: Las Montañas de la Locura – Electric Boogaloo","description":"FANHUNTER, THE MOUNTAINS OF MADNESS. ELECTRIC BOOGALOO<br/><br/>// INTRODUCTION &not;<br/><br/>In 1930, the Pabodie Expedition left for the Antarctic Continent to carry out Geological prospecting operations. <br/>Part of the crew died and some of its members returned suffering from terrible psychological trauma due to the unfathomable primeval horrors they encountered.<br/>In late 1934 all contact was lost with the Starkweather-Moore Expedition. It had followed in the footsteps of the first expedition, but all its team disappeared without leaving a trace.<br/>In 1937 the millionaire philanthropist Alejo Crow begins investigating these strange occurrences.<br/>On board the battleship Gigamesh, following the geographic indications hidden in the Necronomicon, the Crow-Yutani Expedition, comprising a select group of explorers and a commando of clone soldiers known as &ldquo;macutes&rdquo;, must face the sinister creatures that await them in the polar ice.<br/>    <br/>// OBJECT OF THE GAME &not;<br/>A cooperative game in which players must try to survive the attack of primeval beings and kill all the monsters. Players lose if the attackers completely destroy the battleship &ldquo;Gigamesh&rdquo; or all the explorers of the resistance die.<br/>All players fight for one common goal: defending the ship from the waves of attacks of 43 monsters that try to devour them.<br/><br/>// GAME CONTENTS &not;<br/><br/>&raquo; 43 monster tiles<br/>&raquo; 14 special tiles<br/>&raquo; 15 explorers with bases<br/>&raquo; 4 barricade tokens<br/>&raquo; 6 destroyed ship  tokens<br/>&raquo; 45 action cards<br/>&raquo; 3 dice<br/>&raquo; 1 board<br/>&raquo; 1 rule book<br/><br/><br/>En 1937, el millonario fil&aacute;ntropo Alejo Crow emprende una investigaci&oacute;n para esclarecer los hechos.<br/><br/>A bordo del acorazado Gigamesh, siguiendo las indicaciones geogr&aacute;ficas ocultas en el Necronomic&oacute;n y compuesta por un selecto grupo de exploradores y de un comando de soldados cl&oacute;nicos conocidos como ?macutes?, la Expedici&oacute;n Crow-Yutani deber&aacute; enfrentarse a las siniestras criaturas que esperan entre los hielos polares.<br/><br/>Este juego se basa en la novela Fanhunter: Las Monta&ntilde;as de la Locura. Electric Boogaloo escrita por Cels Pi&ntilde;ol y publicada por Panini Books, que a su vez fusiona su personal universo de personajes con la obra En las Monta&ntilde;as de la Locura de<br/>H. P. Lovecraft.<br/><br/>OBJETIVO DEL JUEGO<br/><br/>Juego cooperativo donde los jugadores deben intentar sobrevivir al ataque de los seres primigenios y matar a todos los monstruos. Pierden si los atacantes destruyen el barco ?Gigamesh? por completo o mueren todos los exploradores de la resistencia.<br/><br/>Todos los jugadores luchan y comparten un mismo objetivo: la defensa del barco ante las oleadas de ataques de 43 monstruos que intentan devorarlos.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/c9XNrzrJi5WgJABDPQZObxbBB3g=/fit-in/200x150/pic1843357.jpg","image":"https://cf.geekdo-images.com/original/img/J13K1ThGROSCLx9WwGKjEeBDY_Q=/0x0/pic1843357.jpg","id":"150615","publishers":["Edigráfica Games"],"categories":["Edigráfica Games"],"mechanics":["Edigráfica Games"],"designers":["Jorge Piñan","Ignacio Sánchez Usera"],"artists":["Cels Piñol"],"family":["Crowdfunding: Verkami","Cthulhu Mythos"]},{"yearpublished":2016,"minplayers":3,"maxplayers":6,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":12,"name":"Airships of Oberon","description":"Game Overview<br/><br/>Go on Airship Missions. Capture Anti-Magnetic Artifacts. Become a Flux Master. Play the ultimate Steampunk board game! What are you waiting for?<br/><br/>Airships of Oberon is a fun, highly social strategy game in which players compete to capture Artifacts and complete missions. It's great for both casual and experienced gamers.<br/><br/>The goal of the game is to complete a series of Missions in which you capture 1 to 4 Flux Artifacts and deliver them to a location on the board. You receive Experience points (XP) for each Artifact you capture and for completing a Mission. When you have earned 36 XP, you become a Flux Master. Then you can complete your final Mission: capture the three keys and go to Oberon City at the center of the board to win the game.<br/><br/>Often players will need the same Artifacts and they will have to chase each other around to capture the Artifacts they need. Players also have twelve Anti-Magnetic Effects that they can use during the game to help themselves and slow down other players. Two of the Effects are unique for each player. During your turn you have the freedom to move via trains or airships, use Anti-Magnetic Effects and take other actions in any order.<br/><br/>There is a lot of fun drama and reversals of fortune in this game. The end-game is quite exciting when you become a Flux-Master and start your final Mission to capture the three keys. Other players will try to stop you using their Anti-magnetic effects, meanwhile other players are becoming Flux Masters and trying to take your keys from you.<br/><br/>Detailed Story Summary<br/><br/>The Divergence: In 1895 a disastrous fire raged through the laboratory of the brilliant inventor Nikola Tesla at 35 South Fifth Avenue, NY, destroying most of his important research papers. One of his business consultants, Charles Oberon, managed to salvage Tesla's documents on wireless power generation. He secretly took these documents back to his home in Denver, and with funding from the Oberon Land Company, patented Tesla's inventions and built the first wireless transmission towers. Using wireless power, airships and trains could now travel lighter without the need for an on-board engine or fuel. Over several years Oberon created a network of airship corridors and super-light rocket-rail trains across the Midwest, all using his wireless transmission towers, competing with and rivaling the railroad dynasties.<br/><br/>Meanwhile Tesla, nearly bankrupt, turned to another neglected research project - Anti-Magnetism. Tesla soon discovered that Anti-Magnetic Flux had elemental Effects that could be used to manipulate matter and perception. He developed various apparatus to harness these Effects: Ocular Attenuators, Anti-Magnetic Shields, Induction-Ray Guns and Temporal Distortion Devices. But having become disillusioned by the patent system, he instead made his technology freely available to a core group of inventors and enthusiasts who soon formed the Anti-Magnetic League. The most skilled practitioners became known as Flux Masters, who spread the knowledge to others and taught the novices in the craft.<br/><br/>Forty years after the Divergence, Oberon City (formerly Denver) had become the most powerful city on the continent and airships traveled across the world. The Anti-Magnetic League, still essentially an underground movement, now had more than a hundred Anti-Magnetic Flux Nodes to power its apparatus. The Flux nodes drew power from Oberon's transmission towers using a &quot;Freedom of the Airwaves&quot; clause in Federal law.<br/><br/>When Oberon realized the massive amount of power that was being siphoned off his network, he sought to shut down the Anti-Magnetic League. Using a combination of legal action, lobbying and propaganda campaigns, he had the Flux Masters and their supporters arrested, and the Flux Nodes dismantled. Most importantly, the League's Codex of research was confiscated and locked up in a secure facility in Oberon City, protected by an electric holo-field.<br/><br/>This was a crushing blow to The Anti-Magnetic League. However, twelve Flux nodes still remained, having been built as backups and cleverly hidden for just such a crisis. And though the Flux Masters had been arrested, other members of the League were still free.<br/><br/>This is where the game begins. The League's Shadow Council believes that only a Flux Master can decode the holo-field and capture the Codex without being detected. So they have set up a competition for all League members: the first member who can become a Flux Master and capture the Codex will be appointed as leader of the League (known as the League Architect) for one year.<br/><br/>The players are members of the Anti-Magnetic League who are competing to rescue the Codex.<br/><br/>Your goal is to go on a series of important missions for the Anti-Magnetic League, capturing Flux Artifacts from the remaining Flux Nodes to help you complete your missions. This will allow you to develop your skill in manipulating Anti-magnetic Flux power. Once you have earned 36 experience points, you will become a Flux Master. Then you can complete your final mission: to capture the Codex in Oberon City.<br/><br/>The first player to capture the Codex wins the game.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/pChC7eK3GoZvWfftPd9aEyCZSSc=/fit-in/200x150/pic3029223.png","image":"https://cf.geekdo-images.com/original/img/tiEv9U6PtVBukHPsqN10TNB0pi0=/0x0/pic3029223.png","id":"167101","publishers":["Reboot Games"],"categories":["Adventure","Aviation / Flight","Science Fiction"],"mechanics":["Dice Rolling","Pick-up and Deliver","Point to Point Movement"],"designers":["Adam Love"],"artists":["Rui Li","Dann May","Tom McGrath"],"family":["Admin: Unreleased Games","Crowdfunding: Kickstarter","Steampunk"]},{"yearpublished":2018,"minplayers":2,"maxplayers":4,"playingtime":20,"minplaytime":10,"maxplaytime":20,"age":8,"name":"Multi Stacks","description":"Multi-Stacks is a cooperative game that can be played with a regular 52-card playing deck.  Players work together to beat the deck rather than each other.  It is quick to play and easy to learn.  The goal is simple: work together to use all the cards in player's hands before running out of cards in the deck.<br/><br/>Every turn consists of three phases: Draw, Play, Pass.  Each player will have to choose how many cards to draw, which cards to play on the stacks, and which cards to pass to fellow players.  Roles limit what cards can be played so that players have to depend on each other.  Work together to keep yourself and your teammates from getting stuck with cards you cannot play.  If everyone gets stuck, you lose.  Play all the cards in your hands to win the game!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/e5SHd4eKDFMBYj-9zSiql6eHNyo=/fit-in/200x150/pic4330452.jpg","image":"https://cf.geekdo-images.com/original/img/T9ozs_YdqvkdlOAUpNb8hlt2SMY=/0x0/pic4330452.jpg","id":"257651","publishers":["(Self-Published)","(Web published)"],"categories":[null],"mechanics":["Card Drafting","Cooperative Play","Pattern Recognition"],"designers":["Edward Doreau"],"artists":["Jose Ocando"]},{"yearpublished":2007,"minplayers":1,"maxplayers":6,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":6,"name":"Der Bauernhof","description":"For the basic game players look at the movie from DVD and then play the game, they roll the die, draw and answer a question at the current field. Player gets chips for correct answers. Who has 8 chips first, wins.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/QwWtC2lV6HwFBXxvALUpwkhNiHM=/fit-in/200x150/pic1137979.png","image":"https://cf.geekdo-images.com/original/img/zjkD2F9khzVhZyHdZmA49xdOixg=/0x0/pic1137979.png","id":"110315","publishers":["Noris Spiele"],"categories":["Noris Spiele"],"mechanics":["Noris Spiele"],"designers":["Michael Rüttinger"],"artists":["Nicole Klapperstück"],"family":["DVD Board Games","Sehen Spielen Lernen"]},{"yearpublished":2015,"minplayers":1,"maxplayers":6,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":10,"name":"Zombicide: Black Plague Special Guest Box – Paolo Parente","description":"A box set of four Zombicide: Black Plague survivors that were designed by Paolo Parente. These four survivor's are from his Anastyr fantasy world.  The survivors include:<br/>Undraal, Queen of the North<br/>Skoll, the Protector<br/>Konrad, Master of Blades<br/>Arbwal, Maiden of War<br/><br/>Anastyr: In the days between the fall of Atlantis and the great Flood that would cover the entire world, conflict brews in the lust jungles and steaming swamps that someday would be the Mediterranean Sea.<br/>Six great tribes of dragons have settled in this fertile valley, each ruling a kingdom of mortal followers. Inevitably, tensions rise between them as they plot for control of the world.<br/>From the North, the humans worship the might Red Dragon who sleeps in the heart of a Great Volcano. To the South, in the deepest parts of the Undermountain, Anastyr - the Queen of All Black Dragons - lies brooding. This is their time, a time of Legend and Raw Magic Powers, a time of epic adventure: When the Dragons of Anastyr rule the Earth!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/4gubEjSQYzEuQcoaPgvVKIQQR1Q=/fit-in/200x150/pic3468944.png","image":"https://cf.geekdo-images.com/original/img/tGnOIdAl5mgIozMp42bJ1mPzXhg=/0x0/pic3468944.png","id":"179607","publishers":["CMON Limited","Guillotine Games"],"categories":["Expansion for Base-game","Fantasy","Horror","Miniatures","Zombies"],"mechanics":["Action Point Allowance System","Cooperative Play","Dice Rolling","Hand Management","Modular Board","Variable Player Powers"],"artists":["Paolo Parente"],"family":["Crowdfunding: Kickstarter","Zombicide"],"expansions":["Zombicide: Black Plague"]},{"yearpublished":2014,"minplayers":3,"maxplayers":5,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":14,"name":"Spurs: A Tale in the Old West – Gatling Gun Promo Card","description":"Spurs Gatling gun promo card.<br/><br/>Available through signing up for Meeple Monthly at Gen Con 2014.<br/><br/>Adds one Gatling Gun equipment card to the game.<br/><br/>Card states: Draw 1 Extra Bullet When Robbing Banks or Fighting Desperados.  Costs $50 and gains one victory point.<br/><br/>","id":"164341","publishers":["Mr. B Games"],"categories":["Action / Dexterity","Adventure","American West","Expansion for Base-game","Real-time"],"mechanics":["Mr. B Games"],"designers":["Ole Steiness"],"family":["Promotional Cards"],"expansions":["Spurs: A Tale in the Old West"]},{"yearpublished":2016,"minplayers":3,"maxplayers":8,"playingtime":60,"minplaytime":30,"maxplaytime":60,"age":14,"name":"Expat Life","description":"Description from the designer:<br/><br/>Expat Life is a phrase-matching game designed around the unique lifestyle of global nomads. Expat Life is perfect for expats, diplomats, military, third culture kids, and social gamers.<br/><br/>The game consists of question cards and answer cards. Each round, a judge puts a question card into play. All other players select the best answer from their hand and pass it to the judge. The judge picks a winner for that round, and the judging duty rotates to the next player.<br/><br/>Expat Life features easy rules and quick set up so you don&rsquo;t waste time. It&rsquo;s a compact card game, so you can throw it in your bag and bring it to a friend&rsquo;s house. The endless combinations of questions and answers will have you laughing right away. The familiar scenarios will have you swapping stories.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/T_NhUBbPs6mKgq91MDf9G3tocXs=/fit-in/200x150/pic3415647.jpg","image":"https://cf.geekdo-images.com/original/img/XK8Il072cm7nTvP7Iq71pmsQhhs=/0x0/pic3415647.jpg","id":"213297","publishers":["Nomadic Dragon Books"],"categories":["Card Game","Humor","Party Game","Print & Play"],"mechanics":["Hand Management","Simultaneous Action Selection"],"designers":["Edward Cox"],"artists":["Edward Cox"]},{"yearpublished":1967,"minplayers":2,"maxplayers":4,"playingtime":20,"minplaytime":20,"maxplaytime":20,"age":0,"name":"Off To See The Wizard","description":"Children scaled board game where children stand in as pawns.<br/><br/>Each player takes his place ate the beginning of his path, He must always move forward the number of steps indicated by the spinner, following the Yellow Brick Road. Obey the signs on each brick. If a a player is in another player's way, you cannot pass him. If a player has been instructed, though, to go to a space already occupied, the more than one player can occupy the space together. The first player to land on the Gate to Oz must spin a number one to enter and win.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/KrsihTa-PHY72nTaiZPnLxVuFEo=/fit-in/200x150/pic103174.jpg","image":"https://cf.geekdo-images.com/original/img/eWLN2SStd4qAjyeGq7COT5xEUKo=/0x0/pic103174.jpg","id":"20990","publishers":["Schaper"],"categories":["Fantasy","Movies / TV / Radio theme","Party Game"],"mechanics":["Schaper"],"designers":["(Uncredited)"],"family":["Wizard of Oz"]},{"yearpublished":1981,"minplayers":2,"maxplayers":10,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":12,"name":"Highway 2000","description":"&quot;A game of automobile conflict in the 21st century&quot;<br/><br/>People create their cars and fill out Vehicle Control Sheets, then pick a scenario (all of which take place on a 5-lane highway) and start attacking each other.  Players normally take one car each, or a cycle pack, picked randomly with a die roll on the encounter chart.  (Used for generating random traffic.)<br/><br/>Mechanics are a lot simpler than most games of this type - movement is composed of making lane changes and moving forward based on your speed.  Acceleration/deceleration and movement is plotted secretly, then simultaneously revealed - each turn each car will move one space forwards or sideways for each 10 MPH of speed, broken up into four phases. (Scale is 20 feet per square.)<br/><br/>Only one car (or two motorcycles) is allowed per square - if two cars try to move together they 'bump' and start rolling for critical damage.  Players can roll to make 'emergency' changes to their plotted movement (which is restricted, for example a 'right' move can never be changed into a 'left' move.)<br/><br/>Combat occurs at the end of every phase.  Drivers can fire one turret, (a group of weapons mounted in one of eight directions) gunners can fire two.  Any/all weapons can be fired each phase, which makes for a lot of shooting opportunities, which is good since weapons only fire in a straight line (front/back/right/left/diagonals.)<br/><br/>Scenarios include the basic duel, &quot;Rush Hour&quot; where there is a chance for random traffic to enter the highway (is what the on-ramp is used for) and a Death Race with 3 to 5 players racing sets of identical cars.<br/><br/>The game comes in a small box, closed with a folding flap like a satchel, complete with 3 highway boards (so you can put the rear board in front and keep driving) counters for the cars, lots of charts &amp; tables, car control sheets and a rule book.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/mI2CwXgGdxeTQ3DuBQ6TZPlhRbY=/fit-in/200x150/pic56634.jpg","image":"https://cf.geekdo-images.com/original/img/bb2Avqof2ldghU3ELyF5PF96yRU=/0x0/pic56634.jpg","id":"13954","publishers":["Threshold Games"],"categories":["Racing","Science Fiction","Wargame"],"mechanics":["Dice Rolling","Modular Board"],"designers":["Russell P. Neal"],"expansions":["The Gauntlet","Hell on Wheels","The Road","Street Fighter","TurboFire","Ultraforce"]},{"yearpublished":1977,"minplayers":2,"maxplayers":4,"playingtime":10,"minplaytime":10,"maxplaytime":10,"age":6,"name":"All Change","description":"From Box Lid: Catch the train at any station and get two passengers in a carriage - but beware! The train moves and the guard may shout All Change!<br/>A captivating game full of fun and elementary strategy for Ages 6 and up<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/EFM-afFoBZbJZwxqdNr1Qu0Xn2E=/fit-in/200x150/pic56745.jpg","image":"https://cf.geekdo-images.com/original/img/Z-bBkQj0icepryiVgWjTeUChX5A=/0x0/pic56745.jpg","id":"13905","publishers":["Holdsworth Thos & Sons","Waddington's Games, Inc."],"categories":["Children's Game","Trains"],"mechanics":[null],"designers":["(Uncredited)"],"family":["Admin: Better Description Needed!"]},{"yearpublished":1982,"minplayers":2,"maxplayers":5,"playingtime":1,"minplaytime":1,"maxplaytime":1,"age":10,"name":"Astro-Dom","description":"Players place the diamond shaped tiles in such a way as to form zodiacs which are hexagons of the six same astrological symbols.  Moon tiles act as wilds.  There is also a second game in which players are given an even set of tiles and simultaneously play to build structures as fast as they can to earn more tiles.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/rqr6wMKA_ZT2d1cW9nevGP70OLw=/fit-in/200x150/pic1930798.jpg","image":"https://cf.geekdo-images.com/original/img/0YvSI-wh6rhTKU8i9E-fCCDVcDs=/0x0/pic1930798.jpg","id":"155064","publishers":["(Unknown)"],"categories":["(Unknown)"],"mechanics":["(Unknown)"],"designers":["(Uncredited)"],"artists":["(Uncredited)"],"family":["Astrology"]},{"yearpublished":1982,"minplayers":2,"maxplayers":2,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":12,"name":"Glory","description":"Glory: A Simulation Study of Individual Combat Between 1750 and 1914.<br/><br/>&quot;Glory is a skirmish warfare set of miniature rules designed to simulate skirmish warfare from 1816-1900. However, the rules have been designed in such a manner so that players can use them for any pre-World War I musket era skirmish action.&quot;<br/><br/>Notes on game scale...<br/>Play can either be at the scale of 1 inch to 5 yards or 1 inch to three yards, or as the rulebook suggests: &quot;For players who prefer using the metric system of measurement consider yards to read meters and use the following scale - One centimeter equals 1 meter (15mm scale). One centimeter equals 1/2 meter (20mm+ scale).<br/><br/>Components:<br/>1 Rulebook (31 pages)<br/>2 Pages of charts (one green &amp; one blue)<br/>1 page Draft - Corrections<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/QSnwJMyvIl3acUFn_iVG0JvBuu8=/fit-in/200x150/pic617637.jpg","image":"https://cf.geekdo-images.com/original/img/Xc1GvFuaurhzux4lTPQK7uThNs4=/0x0/pic617637.jpg","id":"62770","publishers":["(Self-Published)"],"categories":["Fighting","Miniatures","Wargame"],"mechanics":["Dice Rolling","Simulation"],"designers":["Rudy Scott Nelson"]},{"yearpublished":2008,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":12,"name":"Experten Quiz Jagd","description":"Objective:<br/>find correct answers for questions out of the world of hunting<br/>- acting by turn -<br/>decision: form 2 teams or act as 'lone fighters'<br/>give fast &amp; correct answers on questions like:<br/>What is meant with 'Schwesternflinten'?<br/>What is meant with 'kundige Person'?<br/><br/>content:<br/>50 cards with 150 questions, multiple-choice-answers and detailed explanations on the back of the cards<br/>remarks:<br/>game belongs to a series: 'Experten Quiz'<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/msd-nEjPlnDs8jj-GiCuFg8Q0-8=/fit-in/200x150/pic1245378.png","image":"https://cf.geekdo-images.com/original/img/2DRdFH3kPC2HXxkFb09tTMMbPZ4=/0x0/pic1245378.png","id":"121081","publishers":["Naumann & Göbel Verlag"],"categories":["Card Game","Educational","Party Game","Trivia"],"mechanics":["Naumann & Göbel Verlag"],"designers":["Johannes Birnbaum"],"artists":["Carmen Strzelecki"],"family":["Experten Quiz","Sports: Hunting"]},{"yearpublished":2008,"minplayers":2,"maxplayers":2,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":8,"name":"Stratego (Revised Edition)","description":"This game is a revision and update of the classic game of Stratego.  It is similar to the latter, in which the purpose is to capture the enemy's flag after secretly placing your units; but here are included new graphics, board, components, and rules.<br/><br/>Stratego: Revised Edition has two rules sets: those of Classic Stratego; and the main ruleset including special movement and attack rules---new for most of the pieces.  All pieces' powers are printed in the rules and on the gameboard. The board is smaller (8 x 10 vs. 10 x 10), and there are fewer pieces (30 vs. 40) than in Stratego.<br/><br/>This edition is set in a fantasy realm with pieces such as Dragons, Dwarves, and Elves replacing the traditional Napoleonic soldiers and theme of Classic Stratego.  One player is the Fire (Red) Army from Volcandria, and the other player is the Ice (Blue) Army from Everwinter (hence, the game's nickname Stratego: Fire &amp; Ice).<br/><br/>Re-implements:<br/><br/>     Stratego<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/zzyVQ5Lda7nPupRpupadmGMfoCM=/fit-in/200x150/pic362170.jpg","image":"https://cf.geekdo-images.com/original/img/1iB0BVDzLJ6VRXxZgslZLTk6NdY=/0x0/pic362170.jpg","id":"40432","publishers":["Hasbro","Milton Bradley","Spin Master Ltd."],"categories":["Abstract Strategy","Bluffing","Deduction","Fantasy","Fighting","Memory"],"mechanics":["Grid Movement","Memory","Secret Unit Deployment"],"designers":["(Uncredited)"],"family":["Stratego Series"]},{"yearpublished":2008,"minplayers":2,"maxplayers":6,"playingtime":120,"minplaytime":120,"maxplaytime":120,"age":6,"name":"Banco Imobiliário Júnior","description":"Based on Banco Imobili&aacute;rio (Monopoly), but with simpler rules and with a shorter playing time. Mainly, properties here are grouped by colors and symbols - and a player can build whenever he has a complete set of colors *or* a complete set of symbols.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/o50q7pugQzt8vxkrg5vnroGf0cc=/fit-in/200x150/pic1285943.jpg","image":"https://cf.geekdo-images.com/original/img/ntKnq-ei3uDetYW1QUl2Gb_ELRA=/0x0/pic1285943.jpg","id":"108878","publishers":["Estrela"],"categories":["Estrela"],"mechanics":["Estrela"],"designers":["Mauricio Vismona","Fabiano Onça"],"family":["Monopoly"]},{"yearpublished":2015,"minplayers":3,"maxplayers":5,"playingtime":60,"minplaytime":0,"maxplaytime":60,"age":0,"name":"Trans-Siberian Railroad","description":"Trans-Siberian Railroad &mdash; one of three titles in Winsome Games 2015 Essen Set &mdash; shares some similarities with older Winsome titles where the rail network is already printed on the board and individual companies purchase the links that are printed.<br/><br/>There are six total companies in the game, though only four are available at the beginning. Once the initial stocks are auctioned, players take turns buying stock, building rails, or passing. Some actions cause the timing cube to move which in turns leads to dividend phases which is one of the end of game triggers. The two other companies become available during a later phase shift. The player with the most money at the end of the game wins.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/ibAO91bdB9JZQ8zVXgCo5Nl_P9g=/fit-in/200x150/pic2608284.jpg","image":"https://cf.geekdo-images.com/original/img/ChwWWQqClEXBmKh9UegDDAAvN2I=/0x0/pic2608284.jpg","id":"180205","publishers":["Winsome Games"],"categories":["Economic","Trains","Transportation"],"mechanics":["Route/Network Building","Stock Holding"],"designers":["Tom Russell"],"family":["Winsome Essen Sets"]},{"yearpublished":2008,"minplayers":2,"maxplayers":4,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":12,"name":"Saigo no Kane","description":"&quot;The first day of a new school year has just begun in the elite school of Kankyou Gakuen. According to the school tradition all who wish to be school president may now present their candidacy to the voters. In order to do that they organize events on the school playing field. All seems to proceed in an atmosphere of friendly rivalry. The truth is, however, that the first week of school is a time of merciless combat during which all is fair. At the end of the week  we will know who gets position and influence and who loses status and privilege.&quot;<br/><br/>Saigo no Kane is a board game in which you will battle your friends for power and authority in a Japanese high school. With the help of students of the election committee (and their parents&rsquo; money) you will organize events to attract voters. The person with the most support after the fifth turn wins.<br/><br/>Home Page: <a target='_blank' href=\"http://www.wolf-fang.pl/?strona=w_przygotowaniu/saigo&amp\" rel=\"nofollow\">http://www.wolf-fang.pl/?strona=w_przygotowaniu/saigo&amp</a>;mode=view&amp;lang=en<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/Fx7oNX__TP96LCp3fv2ivdP_Ejw=/fit-in/200x150/pic347125.jpg","image":"https://cf.geekdo-images.com/original/img/iEaWu1DdPMpT9GQ-taxqEMXAUrk=/0x0/pic347125.jpg","id":"32995","publishers":["Wolf Fang P.H."],"categories":["Wolf Fang P.H."],"mechanics":["Wolf Fang P.H."],"designers":["Marcin Podsiadło"],"artists":["Joanna Krótka","Agnieszka Miroslaw","Tomasz Tworek"],"family":["Anime & Manga","Asian Theme","Country: Japan"]},{"yearpublished":2007,"minplayers":2,"maxplayers":2,"playingtime":180,"minplaytime":180,"maxplaytime":180,"age":0,"name":"DBMM Army Lists Book 3: 476 AD to 1071 AD","description":"Eighty army lists for DBMM rules. Despite being numbered book three these were the first lists to be published for DBMM.<br/><br/>Also includes instructions for using the lists with DBM.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/PLU_xWPwJ1tXOOHu1uNVVrrwEzM=/fit-in/200x150/pic419136.jpg","image":"https://cf.geekdo-images.com/original/img/hriH7PCREnsrGaE7jUFaSEydKNA=/0x0/pic419136.jpg","id":"36397","publishers":["Partizan Press","Wargames Research Group"],"categories":["Book","Expansion for Base-game","Miniatures","Wargame"],"mechanics":["Dice Rolling","Simulation"],"designers":["Philip C. Barker"],"family":["DBx"],"expansions":["De Bellis Magistrorum Militum"]},{"yearpublished":1956,"minplayers":2,"maxplayers":4,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":8,"name":"Sooty Saves Sixpence","description":"Card game using ideas from a regular card game called Casino. The cards all feature Sooty but they also have amounts of money on each one, ranging from 1 penny to 1 shilling (that is 12 pennies). Four cards are laid face-up in the middle of the table and each player is dealt 4 cards. In your turn you can take a card from the display by using a card with the same value from your hand. Alternatively, you could add a card from your hand, and add it to the amount on the card on the table, with a view to taking it next turn with a card equal to the total on the two cards which you were 'building'. However, before your next turn comes round, another player might be able to take your 'build'.<br/>There are special cards that score more than normal.<br/>The game ends when the pack runs out. Cards you captured are added up, their face value in money. Then any Lucky Pennies score as 1 shilling. Any Lucky Sixpence scores 2 shillings. Any Money Boxes score 4 shillings and twopence. The player with the most in his 'savings' wins the game.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/m_sxluOGkURe-2C0gvl3yaQZ8cg=/fit-in/200x150/pic986579.jpg","image":"https://cf.geekdo-images.com/original/img/-ec-H_8W8RMb0Yqdjezalp4YKjo=/0x0/pic986579.jpg","id":"98000","publishers":["Ariel Productions Ltd"],"categories":["Card Game","Economic","Movies / TV / Radio theme"],"mechanics":["Ariel Productions Ltd"],"family":["Animals: Bears","Characters: Sooty"]},{"yearpublished":2014,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":6,"name":"Turbo Ludo","description":"This game is a reimplemention of Ludo containing a the normal 4x4 player pawns, a Globe-ludo die (with four numbers, a star and a globe) and a redesigned Ludo board:<br/><br/>The board is like in the normal Globe Ludo, but with added features;<br/>Orange spot = Move 3 ahead<br/>Green spot = Move 2 back<br/>and a spot for taking a chance card.<br/><br/>The basic rules are the same.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/ks00vX2adlPyWVRPJBlmj5Zc_N8=/fit-in/200x150/pic2314054.jpg","image":"https://cf.geekdo-images.com/original/img/OCix_KW8Ys-7fowB83uuM2Hzu6Q=/0x0/pic2314054.jpg","id":"169405","publishers":["Atmosphere"],"mechanics":["Atmosphere"],"artists":["Jens Julius Hansen"],"family":["Pachisi-Ludo"]},{"yearpublished":1971,"minplayers":2,"maxplayers":4,"playingtime":15,"minplaytime":15,"maxplaytime":15,"age":0,"name":"Shake-A-Leg Game","description":"A large number of small plastic yellow chips are placed inside a large red plastic shoe which has two circular holes on each side. A small number of chips differ from the majority and cause a particular action to occur should they be shaken from the shoe during a player's turn.<br/><br/>A turn consists of shaking the shoe for as long as it takes a marble to come to rest in the small parabolic bowl included with the game. The first player to collect 20 'normal' chips is the winner.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/vszJo82apdrXSvBDil3ghmhNLgE=/fit-in/200x150/pic315608.jpg","image":"https://cf.geekdo-images.com/original/img/5lpAWkUudLJ7u_PF92V8yAEeu3I=/0x0/pic315608.jpg","id":"35326","publishers":["Schaper"],"categories":["Schaper"],"mechanics":["Schaper"],"designers":["Marvin Glass"]},{"yearpublished":2010,"minplayers":2,"maxplayers":6,"playingtime":30,"minplaytime":30,"maxplaytime":30,"age":12,"name":"Dragon Blast: Battlestorm","description":"Dragon Blast is a Super Powered, Martial Arts Combat Card Game AND Board Game! In this hybrid game, the players battle to see who will be the last one standing. You must use your cards strategically to attack and defend against the other players as well as move your character around a tactical game board. Battle to knock out your opponents while powering yourself up to unleash incredible, legendary attacks!<br/><br/>But you must beware, there are other incredible warriors with other super-powered attacks! You can play as one of six legendary combatants each with their own powers and style of fighting.<br/><br/>To be successful you must learn to use and master a variety of attacks and defenses! Punch, Kick, Block, Dodge and Blast your way to victory!<br/><br/>You can play this game in a two player duel or up to four players in a free-for-all brawl! Don&rsquo;t like to be alone? Team up with a partner and play two versus two teams!<br/><br/>Choose from two different Battlefields to wage your destruction on!<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/wf-Os3m8l0XhzB8rTN0MR7ppPkQ=/fit-in/200x150/pic903524.jpg","image":"https://cf.geekdo-images.com/original/img/4u2FaSDX8W3MxL5eb4zFQFOGGrw=/0x0/pic903524.jpg","id":"89933","publishers":["The Game Crafter, LLC","Nightstalker Games"],"categories":["Card Game","Comic Book / Strip","Fantasy","Fighting"],"mechanics":["Area Movement","Cooperative Play","Hand Management","Partnerships","Variable Phase Order","Variable Player Powers"],"designers":["Eriberto Rodriguez"],"artists":["Eriberto Rodriguez"],"family":["Sports: Combat Sports / Martial Arts"]},{"yearpublished":2008,"minplayers":2,"maxplayers":0,"playingtime":60,"minplaytime":60,"maxplaytime":60,"age":14,"name":"AT-43 Attachment Box: Storm Golems","description":"This Attachment Box contains a storm golem overseer with nanoblaster and reaper blades, two storm golems with sonic gun, two storm golems with flamer and a storm golem relay with nanoblaster and reaper blades.<br/><br/>With these extra choices, your Therian soldiers will get real leadership and a wider range of special weapons. Flamer or Sonic gun, devastating rate of fire or napalm tidal waves? Adapt your methods to your opponent.<br/><br/>","id":"143434","publishers":["Rackham"],"categories":["Expansion for Base-game","Miniatures","Science Fiction","Wargame"],"mechanics":["Dice Rolling","Player Elimination"],"family":["AT-43"],"expansions":["AT-43 Initiation Set: Operation Damocles"]},{"yearpublished":0,"minplayers":2,"maxplayers":6,"playingtime":60,"minplaytime":20,"maxplaytime":60,"age":7,"name":"Operation: Overfur","description":"Operation: Overfur is a family friendly card game where players take turns playing cards that match the species or class of the card on the top of the discard stack.<br/><br/>However the game has various special cards that can be played to trip up your friends and family.<br/><br/>Persevere through the special cards and be the first player to place the last character card in your hand on the pile to win the game.<br/><br/>","id":"219214","publishers":["(Self-Published)"],"categories":["Animals","Card Game","Party Game"],"mechanics":["(Self-Published)"],"designers":["Zachary Fischer"],"artists":["Sophiya Zakrghevska"],"family":["Animals: Cats","Animals: Dogs","Animals: Hamsters","Card Games: Matching Games","Card Games: Outplay Games","Ninja","Robots"]},{"yearpublished":0,"minplayers":2,"maxplayers":4,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":14,"name":"Attack on Mars","description":"Genericorp's experiments opened the rift at the bottom of the of the Helles Sea, horrific monsters are pouring through, and you need to fight them back! Attack on Mars is a co-op game for 2-4 players. Choose your pilot, your corporation, and your Mecha. Upgrade your Mecha while defending cities and fighting monsters. Research how to close the rift and then fight the Guardian in order to do so. Win, and Mars is safe. For now.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/d4nahmM4qHCFZuop1QZFXPhx5Cg=/fit-in/200x150/pic2575240.png","image":"https://cf.geekdo-images.com/original/img/3EAR3rGhhErIVvPSNttlLy5EN1E=/0x0/pic2575240.png","id":"159234","publishers":["(Unknown)"],"categories":["Dice","Science Fiction"],"mechanics":["Action Point Allowance System","Cooperative Play","Dice Rolling"],"designers":["Paul Ference"],"artists":["Alice Bessoni"]},{"yearpublished":2016,"minplayers":3,"maxplayers":7,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":10,"name":"Krazy Wordz: Family Edition","description":"In each round of Krazy Wordz, players have their own individual topic card not known to anyone else (e.g., &quot;something tiny&quot; or &quot;brand of chocolate bar&quot;), along with a few randomly drawn letters. They each create a word &mdash; or something resembling a word &mdash; from these letters, then place their word in the center of the table and their card face down. Once everyone has finished, shuffle the topic cards, then reveal them all. Players then secretly vote on which words are associated with which cards, scoring points when they guess correctly and when others correctly link their word with their card.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/OePaOXQD6950jq-dzUc0YqZF7oc=/fit-in/200x150/pic3664944.jpg","image":"https://cf.geekdo-images.com/original/img/IKDeX0edAssT4OCIaPl5P5cBY3Y=/0x0/pic3664944.jpg","id":"231962","publishers":["Fishtank","Ravensburger Spieleverlag GmbH"],"categories":["Party Game","Word Game"],"mechanics":[null],"designers":["Dirk Baumann","Thomas Odenhoven","Matthias Schmitt"]},{"yearpublished":2014,"minplayers":3,"maxplayers":6,"playingtime":90,"minplaytime":90,"maxplaytime":90,"age":10,"name":"Catan World Championship Berlin 2014 Special","description":"CWC Berlin 2014 Special is a small expansion of the Settlers of Catan base game, given to contestants at the 2014 Catan World Championship.<br/><br/>After distributing the remaining terrain hexes and number tokens according to the game rules, the Berlin hex &quot;Brandenburg Gate&quot; replaces the desert and the Berlin hex &quot;Museum for Communication&quot; replaces the hex that received the 2 token; the 2 token is removed from the game.  The &quot;Berlin Bear&quot; replaces the robber (malicious gossip has it that Berlin's heraldic animal is collecting resources for the completion of the Berlin airport).<br/><br/>When a 7 is rolled, the resulting actions are carried out according to the normal rules.  Afterwards, each player with a settlement or city at a corner of a Berlin hex receives the resource produced by the terrain hex the &quot;Berlin bear&quot; was moved to.  A player who has various settlements or cities adjacent to a Berlin hex still only gets 1 resource.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/_FHa-c64H0VjNMmTZLtRQrGKgjY=/fit-in/200x150/pic2284659.jpg","image":"https://cf.geekdo-images.com/original/img/6yEjrX4LSeLwFurXc-yP3uqeH7M=/0x0/pic2284659.jpg","boardgamecompilation":{"_attributes":{"objectid":"182880"},"_text":"Catan: Big Box"},"id":"167573","publishers":["KOSMOS"],"categories":["Civilization","Expansion for Base-game","Negotiation"],"mechanics":["Dice Rolling","Hand Management","Modular Board","Route/Network Building","Trading"],"designers":["Klaus Teuber","Benjamin Teuber"],"artists":["Tanja Donner","Michaela Kienle","Michael Menzel"],"family":["Catan","Cities: Berlin (Germany)","Mayfair Promotional Expansions"],"expansions":["Catan"]},{"yearpublished":2001,"minplayers":2,"maxplayers":5,"playingtime":20,"minplaytime":20,"maxplaytime":20,"age":0,"name":"Snarfquest Expansion 3 (Aveeare)","description":"An expansion for the first edition of Snarf Quest.<br/><br/>This expansion pack includes 20 cards (2 each of 10 new card designs) including the robot Aveeare, also provided as a miniature.<br/><br/>Available with blue, black, white, red or yellow borders.<br/><br/>Expands:<br/><br/>    Snarf Quest<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/6NWLpHlccVLq7SIDzhzgcu_z1B8=/fit-in/200x150/pic450580.jpg","image":"https://cf.geekdo-images.com/original/img/eBX9371nVV3DnASjVt_UBWc4v04=/0x0/pic450580.jpg","id":"33203","publishers":["Agents of Gaming"],"categories":["Card Game","Comic Book / Strip","Expansion for Base-game","Fantasy","Humor","Medieval"],"mechanics":["Card Drafting","Cooperative Play","Storytelling"],"designers":["Jeremy Elmore","Larry Elmore","Ken Whitman"],"expansions":["Snarf Quest"]},{"yearpublished":2015,"minplayers":2,"maxplayers":4,"playingtime":20,"minplaytime":10,"maxplaytime":20,"age":8,"name":"Mondo: Der rasante Legespaß","description":"Mondo: Der rasante Legespa&szlig; is a tile-laying game along the lines of Mondo with modified rules and only 48 landscape tiles. Mondo: Der rasante Legespa&szlig; can be combined with the Mondo base game. Detailed differences to come later.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/BA3oBRjMdDzDXXO6vgYzWq6POV0=/fit-in/200x150/pic1907813.jpg","image":"https://cf.geekdo-images.com/original/img/LShXi8ZWDwzh6PFM9uw_U5yv_Yw=/0x0/pic1907813.jpg","id":"154009","publishers":["dV Giochi","Lautapelit.fi","Pegasus Spiele"],"categories":[null],"mechanics":[null],"designers":["Michael Schacht"],"artists":["Oliver Freudenreich"],"family":["Admin: Better Description Needed!","Mondo"]},{"yearpublished":2016,"minplayers":2,"maxplayers":2,"playingtime":25,"minplaytime":15,"maxplaytime":25,"age":6,"name":"Flitting Bad Wolf","description":"Big Bad Wolf is so annoying! No one wants to be his neighbor! People start to move around in the town to stay away from him. Will you be lucky enough to live happily ever after &mdash; or end up being annoyed by the Big Bad Wolf for the rest of your life?<br/><br/>Flitting Bad Wolf is a microgame of deduction and bluffing. Players try to get the most valuable cards while avoiding a visit from the Big Bad Wolf! On a player's turn, they may choose to (1) offer a hand card to the opponent (who may refuse), or (2) play a card and execute the ability. Players alternate turns until no one has any cards in hand, and the round scoring takes place. The game is played for a number of rounds until one player has scored 11 or more points to become the winner.<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/J_TQts9baDlRhGBnkeeASCoxbao=/fit-in/200x150/pic3195591.jpg","image":"https://cf.geekdo-images.com/original/img/TatJHx6SpXPxtcHlc7H6AAEux-8=/0x0/pic3195591.jpg","id":"209713","publishers":["Homosapiens Lab"],"categories":["Animals","Bluffing","Card Game","Deduction"],"mechanics":["Hand Management","Take That","Variable Player Powers"],"designers":["Chih-Fan Chen"],"artists":["Chih-Fan Chen"]},{"yearpublished":1999,"minplayers":3,"maxplayers":5,"playingtime":45,"minplaytime":45,"maxplaytime":45,"age":10,"name":"Der Herr der Wichtel","description":"From 5 Leprechauns laid out in an ever-changing array you try to recruit the best group to win the title of Lord of the Leprechauns. To help or hinder recruiting there are event cards that can be played. Each Leprechaun has a value plus there are bonuses given for the right mix of Leprechaun types.<br/><br/>Lightweight but fun!<br/><br/>Expanded by:<br/><br/>    Neues aus dem Wichtelwald<br/><br/><br/><br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/HquVQKIIBJsbPt2-YUDeTORc1MQ=/fit-in/200x150/pic59506.jpg","image":"https://cf.geekdo-images.com/original/img/N5fVNQVrP4EhnhpyIvTYrsRChFI=/0x0/pic59506.jpg","id":"2068","publishers":["Krimsus Krimskrams-Kiste"],"categories":["Card Game","Fantasy"],"mechanics":["Krimsus Krimskrams-Kiste"],"designers":["Ralf Sandfuchs"],"artists":["Daniel Alles","Sebastian Fugenzi"],"expansions":["Neues aus dem Wichtelwald"]},{"yearpublished":2006,"minplayers":2,"maxplayers":4,"playingtime":0,"minplaytime":0,"maxplaytime":0,"age":10,"name":"Cloud Wars","description":"Vermix roared as the zeppelin&rsquo;s cannons blasted into him, the great dragon screaming in terrible pain as the cannon ball smashed into his armored hide. Any other dragon might have been blow from the skies with such a volley of lead shot, but Vermix was no weakling, but rather one of the true kings of the skies. The wizards of Tor thought they could take the dragon lord&rsquo;s territory without much of a fight from the might red dragon, but these wizards were fools, for Vermix never surrendered and had yet to lose a battle for control of the clouds that he called home.<br/><br/>This is Cloud Wars', yet another Mini-Game from Bad Baby Production. In Cloud Wars, you and other players take on the role of mighty air ships, eagle riders and lords of cloud castles as you battle for control of the skies above a fantasy world. The first expansion for the Dragon Wars game, now players can lead forces of wizard forged zeppelins and marshal squadrons of might eagle riders. Fully compatible with Dragon War, have fun and battle for the skies.<br/><br/>Using a fast turn based system; the combat is swift, the excitement nail biting and the strategy intense. Do you dare enter the world of dragons, wizards and cannons&hellip;<br/><br/>","thumbnail":"https://cf.geekdo-images.com/thumb/img/XAe_sfSPX-noTliM3blFTgl_tfg=/fit-in/200x150/pic182066.jpg","image":"https://cf.geekdo-images.com/original/img/kP9WZxuq5cB4l9lGbVj8F1ZNedo=/0x0/pic182066.jpg","id":"27788","publishers":["Avalon Games"],"categories":["Fantasy","Print & Play"],"mechanics":["Action Point Allowance System","Hex-and-Counter","Variable Player Powers"],"designers":["Robert Hemminger"],"artists":["Robert Hemminger"],"family":["Bad Baby Productions Minigames"]}]}